bobmittmann/thinkos/sdk/include/stm32f/stm32f-otg_fs.h
/* 
 * Copyright(C) 2012 Robinson Mittmann. All Rights Reserved.
 * 
 * This file is part of the libstm32f.
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation; either
 * version 3.0 of the License, or (at your option) any later version.
 * 
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 * 
 * You can receive a copy of the GNU Lesser General Public License from 
 * http://www.gnu.org/
 */

/** 
 * @file stm32f-otg_fs.h
 * @brief
 * @author Robinson Mittmann <bobmittmann@gmail.com>
 */ 

#ifndef __STM32F_OTG_FS_H__
#define __STM32F_OTG_FS_H__

/* -------------------------------------------------------------------------
 * OTG_FS control and status register */
#define STM32F_OTG_FS_GOTGCTL 0x000

/* Bit 20 OTGVER: OTG version */
/* Selects the OTG revision.
0:OTG Version 1.3. In this version the core supports Data line pulsing and VBUS pulsing for
SRP.
1:OTG Version 2.0. In this version the core supports only Data line pulsing for SRP. */

/* Bit 19 - B-session valid */
#define OTG_FS_BSVLD (1 << 19)
/* Indicates the device mode transceiver status.
	0: B-session is not valid.
	1: B-session is valid.
	In OTG mode, you can use this bit to determine if the device is 
	connected or disconnected. Note: Only accessible in device mode. */

/* Bit 18 - A-session valid */
#define OTG_FS_ASVLD (1 << 18)
/* Indicates the host mode transceiver status.
	0: A-session is not valid
	1: A-session is valid
	Note: Only accessible in host mode. */

/* Bit 17 - Long/short debounce time */
#define OTG_FS_DBCT (1 << 17)
/* Indicates the debounce time of a detected connection.
	0: Long debounce time, used for physical connections (100 ms + 2.5 μs)
	1: Short debounce time, used for soft connections (2.5 μs)
	Note: Only accessible in host mode. */

/* Bit 16 - Connector ID status */
#define OTG_FS_CIDSTS (1 << 16)
/* Indicates the connector ID status on a connect event.
	0: The OTG_FS controller is in A-device mode
	1: The OTG_FS controller is in B-device mode
	Note: Accessible in both device and host modes. */

/* [15..12] Reserved */

/* Bit 11 - Device HNP enabled */
#define OTG_FS_DHNPEN (1 << 11)
/* The application sets this bit when it successfully receives 
   a SetFeature.SetHNPEnable command from the connected USB host.
	0: HNP is not enabled in the application
	1: HNP is enabled in the application
	Note: Only accessible in device mode. */

/* Bit 10 - host set HNP enable */
#define OTG_FS_HSHNPEN (1 << 10)
/* The application sets this bit when it has successfully enabled 
   HNP (using the SetFeature.SetHNPEnable command) on the connected device.
	0: Host Set HNP is not enabled
	1: Host Set HNP is enabled
	Note: Only accessible in host mode. */

/* Bit 9 - HNP request */
#define OTG_FS_HNPRQ (1 << 9)
/* The application sets this bit to initiate an HNP request to the 
   connected USB host. The application can clear this bit by writing a 0 
   when the host negotiation success status change bit in the OTG_FS_GOTGINT 
   register (HNSSCHG bit in OTG_FS_GOTGINT) is set. The core clears this 
   bit when the HNSSCHG bit is cleared.
	0: No HNP request
	1: HNP request
	Note: Only accessible in device mode. */

/* Bit 8 - Host negotiation success */
#define OTG_FS_HNGSCS (1 << 8)
/* The core sets this bit when host negotiation is successful. The core 
   clears this bit when the HNP Request (HNPRQ) bit in this register is set.
	0: Host negotiation failure
	1: Host negotiation success
	Note: Only accessible in device mode. */

/* Bit 7 BVALOVAL: B-peripheral session valid override value */
#define OTG_FS_BVALOVAL (1 << 7)
/* This bit is used to set override value for Bvalid signal when 
   BVALOEN bit is set.
   0: Bvalid value is '0' when BVALOEN = 1
   1: Bvalid value is '1' when BVALOEN = 1
   Note: Only accessible in device mode. */

/* Bit 6 BVALOEN: B-peripheral session valid override enable */
#define OTG_FS_BVALOEN (1 << 6)
/* This bit is used to enable/disable the software to override the 
   Bvalid signal using the BVALOVAL bit.
   0: Override is disabled and Bvalid signal from the respective PHY 
   selected is used internally by the core
   1: Internally Bvalid received from the PHY is overridden with 
   BVALOVAL bit value
   Note: Only accessible in device mode. */

/* [5..2] Reserved */

/* Bit 1 - Session request */
#define OTG_FS_SRQ (1 << 1)
/* The application sets this bit to initiate a session request on the USB. 
   The application can clear this bit by writing a 0 when the host 
   negotiation success status change bit in the OTG_FS_GOTGINT register 
   (HNSSCHG bit in OTG_FS_GOTGINT) is set. The core clears this bit when 
   the HNSSCHG bit is cleared.
   If you use the USB 1.1 full-speed serial transceiver interface to 
   initiate the session request, the application must wait until VBUS 
   discharges to 0.2 V, after the B-Session Valid bit in this register
   (BSVLD bit in OTG_FS_GOTGCTL) is cleared. This discharge time varies 
   between different PHYs and can be obtained from the PHY vendor.
	0: No session request
	1: Session request
	Note: Only accessible in device mode. */

/* Bit 0 - Session request success */
#define OTG_FS_SRQSCS (1 << 0)
/* The core sets this bit when a session request initiation is successful.
	0: Session request failure
	1: Session request success
	Note: Only accessible in device mode. */


/* -------------------------------------------------------------------------
 * OTG_FS interrupt register 
 */
#define STM32F_OTG_FS_GOTGINT 0x004

/* [31..21] Reserved. */

/* Bit 20 IDCHNG: */
#define OTG_FS_IDCHNG (1 << 20)
/* This bit when set indicates that there is a change in the value 
   of the ID input pin. */

/* Bit 19 - Debounce done */
#define OTG_FS_DBCDNE (1 << 19)
/* The core sets this bit when the debounce is completed after the device 
   connect. The application can start driving USB reset after seeing this 
   interrupt. This bit is only valid when the HNP Capable or SRP Capable bit 
   is set in the OTG_FS_GUSBCFG register (HNPCAP bit or SRPCAP bit in 
   OTG_FS_GUSBCFG, respectively).
	Note: Only accessible in host mode. */

