bobmittmann/thinkos/sdk/include/stm32f/stm32f-otg_fs.h
/* Bit 18 - A-device timeout change */
#define OTG_FS_ADTOCHG (1 << 18)
/* The core sets this bit to indicate that the A-device has timed out while 
   waiting for the B-device to connect.
	Note: Accessible in both device and host modes. */

/* Bit 17 - Host negotiation detected */
#define OTG_FS_HNGDET (1 << 17)
/* The core sets this bit when it detects a host negotiation request on 
 * the USB. 
 * Note: Accessible in both device and host modes. */

/* [16..10] Reserved. */

/* Bit 9 - Host negotiation success status change */
#define OTG_FS_HNSSCHG (1 << 9)
/* The core sets this bit on the success or failure of a USB host negotiation 
 * request. The application must read the host negotiation success bit of the 
 * OTG_FS_GOTGCTL register (HNGSCS in OTG_FS_GOTGCTL) to check for success or 
 * failure.
 * Note: Accessible in both device and host modes. */

/* [7..3] Reserved. */

/* Bit 8 - Session request success status change */
#define OTG_FS_SRSSCHG (1 << 8)
/* The core sets this bit on the success or failure of a session request. The 
   application must read the session request success bit in the OTG_FS_GOTGCTL 
   register (SRQSCS bit in OTG_FS_GOTGCTL) to check for success or failure. 
	Note: Accessible in both device and host modes. */

/* Bit 2 - Session end detected */
#define OTG_FS_SEDET (1 << 2)
/* The core sets this bit to indicate that the level of the voltage on VBUS 
   is no longer valid for a B-Peripheral session when VBUS < 0.8 V. */

/* [1..0] Reserved. */


/* -------------------------------------------------------------------------
 * OTG_FS AHB configuration register */
#define STM32F_OTG_FS_GAHBCFG 0x008

/* [31..20] Reserved. */

/* Bit 8 - Periodic TxFIFO empty level */
#define OTG_FS_PTXFELVL (1 << 8)
/* Indicates when the periodic TxFIFO empty interrupt bit in the 
 * OTG_FS_GINTSTS register (PTXFE bit in OTG_FS_GINTSTS) is triggered.
 * 0: PTXFE (in OTG_FS_GINTSTS) interrupt indicates that the Periodic 
 * TxFIFO is half empty
 * 1: PTXFE (in OTG_FS_GINTSTS) interrupt indicates that the Periodic 
 * TxFIFO is completely empty
 * Note: Only accessible in host mode. */

/* Bit 7 - TxFIFO empty level */
#define OTG_FS_TXFELVL (1 << 7)
/* In device mode, this bit indicates when IN endpoint Transmit FIFO empty 
 *    interrupt (TXFE in OTG_FS_DIEPINTx.) is triggered.
 * 0: the TXFE (in OTG_FS_DIEPINTx) interrupt indicates that the IN Endpoint 
 *    TxFIFO is half empty
 * 1: the TXFE (in OTG_FS_DIEPINTx) interrupt indicates that the IN Endpoint 
 *    TxFIFO is completely empty
 * In host mode, this bit indicates when the nonperiodic Tx FIFO empty 
 *    interrupt (NPTXFE bit in OTG_FS_GINTSTS) is triggered:
 * 0: the NPTXFE (in OTG_FS_GINTSTS) interrupt indicates that the 
 *    nonperiodic Tx FIFO is half empty
 * 1: the NPTXFE (in OTG_FS_GINTSTS) interrupt indicates that the 
 *    nonperiodic Tx FIFO is completely empty */

/* [6..1] Reserved. */


/* Bit 0 - Global interrupt mask */
#define OTG_FS_GINTMSK (1 << 0)
/* The application uses this bit to mask or unmask the interrupt line 
   assertion to itself. Irrespective of this bit’s setting, the interrupt 
   status registers are updated by the core.
   0: Mask the interrupt assertion to the application.
   1: Unmask the interrupt assertion to the application.
   Note: Accessible in both device and host modes. */


/* -------------------------------------------------------------------------
 * OTG_FS USB configuration register */
#define STM32F_OTG_FS_GUSBCFG 0x00C


/* [31..20] Reserved. */


/* Bit 31 - Corrupt Tx packet */
#define OTG_FS_CTXPKT (1 << 31)
/* This bit is for debug purposes only. Never set this bit to 1.
   Note: Accessible in both device and host modes. */

/* Bit 30 - Force device mode */
#define OTG_FS_FDMOD (1 << 30)
/* Writing a 1 to this bit forces the core to device mode irrespective 
   of the OTG_FS_ID input pin.
   0: Normal mode
   1: Force device mode
   After setting the force bit, the application must wait at least 25 ms 
   before the change takes effect.
   Note: Accessible in both device and host modes. */

/* Bit 29 - Force host mode */
#define OTG_FS_FHMOD (1 << 29)
/* Writing a 1 to this bit forces the core to host mode irrespective of the 
   OTG_FS_ID input pin.
   0: Normal mode
   1: Force host mode
   After setting the force bit, the application must wait at least 25 ms 
   before the change takes effect.
   Note: Accessible in both device and host modes. */

/* [28..14] Reserved */

/* Bits [13..10] - USB turnaround time */
#define OTG_FS_TRDT ((13 - 10) << 10)
#define OTG_FS_TRDT_MSK (((1 << (13 - 10 + 1)) - 1) << 10)
#define OTG_FS_TRDT_SET(VAL) (((VAL) << 10) & OTG_FS_TRDT_MSK)
#define OTG_FS_TRDT_GET(REG) (((REG) & OTG_FS_TRDT_MSK) >> 10)
/* Sets the turnaround time in PHY clocks.
   To calculate the value of TRDT, use the following formula:
   TRDT = 4 × AHB clock + 1 PHY clock
   Examples:
   1. if AHB clock = 72 MHz (PHY Clock is 48), the TRDT is set to 9.
   2. if AHB clock = 48 MHz (PHY Clock is 48), the TRDT is set to 5.
   Note: Only accessible in device mode. */

/* Bit 9 - HNP-capable */
#define OTG_FS_HNPCAP (1 << 9)
/* The application uses this bit to control the OTG_FS controller’s HNP 
   capabilities.
   0: HNP capability is not enabled.
   1: HNP capability is enabled.
   Note: Accessible in both device and host modes. */

/* Bit 8 - SRP-capable */
#define OTG_FS_SRPCAP (1 << 8)
/* The application uses this bit to control the OTG_FS controller’s SRP 
   capabilities. If the core operates as a non-SRP-capable B-device, it 
   cannot request the connected A-device (host) to activate VBUS and start 
   a session.
   0: SRP capability is not enabled.
   1: SRP capability is enabled.
   Note: Accessible in both device and host modes. */

/* Bit 7 - Full Speed serial transceiver select */
#define OTG_FS_PHYSEL (1 << 7)
/* This bit is always 1 with write-only access. */

/*   Bits [6:3] Reserved */

/* Bits [2:0] : FS timeout calibration */
#define OTG_FS_TOCAL ((2 - 0) << 0)
#define OTG_FS_TOCAL_MSK (((1 << (2 - 0 + 1)) - 1) << 0)
#define OTG_FS_TOCAL_SET(VAL) (((VAL) << 0) & OTG_FS_TOCAL_MSK)
#define OTG_FS_TOCAL_GET(REG) (((REG) & OTG_FS_TOCAL_MSK) >> 0)
/* The number of PHY clocks that the application programs in this field 
   is added to the full-speed interpacket timeout duration in the core to 
   account for any additional delays introduced by the PHY. This can be 
   required, because the delay introduced by the PHY in generating the line
   state condition can vary from one PHY to another.
   The USB standard timeout value for full-speed operation is 16 to 18 
   (inclusive) bit times. The application must program this field based on 
   the speed of enumeration. The number of bit times added per PHY 
   clock is 0.25 bit times. */


/* -------------------------------------------------------------------------
 * OTG_FS reset register */
#define STM32F_OTG_FS_GRSTCTL 0x10

/* Bit 31 - AHB master idle */
#define OTG_FS_AHBIDL (1 << 31)
/* Indicates that the AHB master state machine is in the Idle condition.
   Note: Accessible in both device and host modes. */

/* [30..11] Reserved */

