bobmittmann/thinkos/sdk/include/stm32f/stm32f-otg_fs.h
/* Bits [10..6] - TxFIFO number */
#define OTG_FS_TXFIFO ((10 - 6) << 6)
#define OTG_FS_TXFIFO_MSK (((1 << (10 - 6 + 1)) - 1) << 6)
#define OTG_FS_TXFIFO_SET(VAL) (((VAL) << 6) & OTG_FS_TXFIFO_MSK)
#define OTG_FS_TXFIFO_GET(REG) (((REG) & OTG_FS_TXFIFO_MSK) >> 6)
#define OTG_FS_TXFIFO_0 (0x00 << 6)
#define OTG_FS_TXFIFO_1 (0x01 << 6)
#define OTG_FS_TXFIFO_2 (0x02 << 6)
#define OTG_FS_TXFIFO_3 (0x03 << 6)
#define OTG_FS_TXFIFO_ALL (0x10 << 6)
#define TXFIFO_ALL 0x10
/* This is the FIFO number that must be flushed using the TxFIFO Flush bit. 
   This field must not be changed until the core clears the TxFIFO Flush bit.
   ● 00000: 
   – Non-periodic TxFIFO flush in host mode
   – Tx FIFO 0 flush in device mode
   ● 00001:
   – Periodic TxFIFO flush in host mode
   – TXFIFO 1 flush in device mode
   ● 00010: TXFIFO 2 flush in device mode
   ...
   ● 00101: TXFIFO 15 flush in device mode
   ● 10000: Flush all the transmit FIFOs in device or host mode.
   Note: Accessible in both device and host modes. */

/* Bit 5 - TxFIFO flush */
#define OTG_FS_TXFFLSH (1 << 5)
/* This bit selectively flushes a single or all transmit FIFOs, but cannot 
   do so if the core is in the midst of a transaction.
   The application must write this bit only after checking that the core 
   is neither writing to the TxFIFO nor reading from the TxFIFO. Verify 
   using these registers:
   Read—NAK Effective Interrupt ensures the core is not reading from the 
   FIFO Write—AHBIDL bit in OTG_FS_GRSTCTL ensures the core is not 
   writing anything to the FIFO.
   Note: Accessible in both device and host modes. */

/* Bit 4 - RxFIFO flush */
#define OTG_FS_RXFFLSH (1 << 4)
/* The application can flush the entire RxFIFO using this bit, but must 
   first ensure that the core is not in the middle of a transaction.
   The application must only write to this bit after checking that the 
   core is neither reading from the RxFIFO nor writing to the RxFIFO.
   The application must wait until the bit is cleared before performing 
   any other operations. This bit requires 8 clocks (slowest of PHY or 
   AHB clock) to clear.
   Note: Accessible in both device and host modes. */

/* Bit 3 Reserved */

/* Bit 2 - Host frame counter reset */
#define OTG_FS_FCRST (1 << 2)
/* The application writes this bit to reset the frame number counter 
   inside the core. When the frame counter is reset, the subsequent SOF 
   sent out by the core has a frame number of 0.
   Note: Only accessible in host mode. */

/* Bit 1 - HCLK soft reset */
#define OTG_FS_HSRST (1 << 1)
/* The application uses this bit to flush the control logic in the AHB 
   Clock domain. Only AHB Clock
   Domain pipelines are reset.
   FIFOs are not flushed with this bit.
   All state machines in the AHB clock domain are reset to the Idle state 
   after terminating the transactions on the AHB, following the protocol.
   CSR control bits used by the AHB clock domain state machines are cleared.
   To clear this interrupt, status mask bits that control the interrupt 
   status and are generated by the AHB clock domain state machine are cleared.
   Because interrupt status bits are not cleared, the application can get 
   the status of any core events that occurred after it set this bit.
   This is a self-clearing bit that the core clears after all necessary 
   logic is reset in the core. This can take several clocks, depending on 
   the core’s current state.
   Note: Accessible in both device and host modes. */

/* Bit 0 - Core soft reset */
#define OTG_FS_CSRST (1 << 0)
/* Resets the HCLK and PCLK domains as follows: 
   Clears the interrupts and all the CSR register bits except 
   for the following bits:
   – RSTPDMODL bit in OTG_FS_PCGCCTL
   – GAYEHCLK bit in OTG_FS_PCGCCTL
   – PWRCLMP bit in OTG_FS_PCGCCTL
   – STPPCLK bit in OTG_FS_PCGCCTL
   – FSLSPCS bit in OTG_FS_HCFG
   – DSPD bit in OTG_FS_DCFG
   All module state machines (except for the AHB slave unit) are reset 
   to the Idle state, and all the transmit FIFOs and the receive FIFO 
   are flushed.
   Any transactions on the AHB Master are terminated as soon as possible, 
   after completing the last data phase of an AHB transfer. Any 
   transactions on the USB are terminated immediately.
   The application can write to this bit any time it wants to reset the 
   core. This is a self-clearing bit and the core clears this bit after 
   all the necessary logic is reset in the core, which can take several 
   clocks, depending on the current state of the core. Once this bit has 
   been cleared, the software must wait at least 3 PHY clocks before 
   accessing the PHY domain (synchronization delay). The software must 
   also check that bit 31 in this register is set to 1 (AHB Master is Idle)
   before starting any operation.
   Typically, the software reset is used during software development and 
   also when you dynamically change the PHY selection bits in the above 
   listed USB configuration registers.
   When you change the PHY, the corresponding clock for the PHY is 
   selected and used in the PHY domain. Once a new clock is selected, the 
   PHY domain has to be reset for proper operation.
   Note: Accessible in both device and host modes. */


/* -------------------------------------------------------------------------
 * OTG_FS core interrupt register */
#define STM32F_OTG_FS_GINTSTS 0x014


/* Bit 31 - Resume/remote wakeup detected interrupt */
#define OTG_FS_WKUPINT (1 << 31)
/* In device mode, this interrupt is asserted when a resume is detected 
   on the USB. In host mode, this interrupt is asserted when a remote 
   wakeup is detected on the USB.
   Note: Accessible in both device and host modes. */

/* Bit 30 - Session request/new session detected interrupt */
#define OTG_FS_SRQINT (1 << 30)
/* In host mode, this interrupt is asserted when a session request is 
   detected from the device. In device mode, this interrupt is asserted 
   when VBUS is in the valid range for a B-peripheral device. 
   Accessible in both device and host modes. */

/* Bit 29 - Disconnect detected interrupt */
#define OTG_FS_DISCINT (1 << 29)
/* Asserted when a device disconnect is detected.
   Note: Only accessible in host mode. */

/* Bit 28 - Connector ID status change */
#define OTG_FS_CIDSCHG (1 << 28)
/* The core sets this bit when there is a change in connector ID status.
   Note: Accessible in both device and host modes. */

/* Bit 27 Reserved */


/* Bit 26 - Periodic TxFIFO empty */
#define OTG_FS_PTXFE (1 << 26)
/* Asserted when the periodic transmit FIFO is either half or completely 
   empty and there is space for at least one entry to be written in 
   the periodic request queue. The half or completely empty
   status is determined by the periodic TxFIFO empty level bit in the 
   OTG_FS_GAHBCFG register (PTXFELVL bit in OTG_FS_GAHBCFG).
   Note: Only accessible in host mode. */

/* Bit 25 - Host channels interrupt */
#define OTG_FS_HCINT (1 << 25)
/* The core sets this bit to indicate that an interrupt is pending on 
   one of the channels of the core (in host mode). The application must 
   read the OTG_FS_HAINT register to determine the exact number of the 
   channel on which the interrupt occurred, and then read the 
   corresponding OTG_FS_HCINTx register to determine the exact cause of 
   the interrupt. The application must clear the appropriate status bit 
   in the OTG_FS_HCINTx register to clear this bit.
   Note: Only accessible in host mode. */

/* Bit 24 - Host port interrupt */
#define OTG_FS_HPRTINT (1 << 24)
/* The core sets this bit to indicate a change in port status of one of 
   the OTG_FS controller ports in host mode. The application must read 
   the OTG_FS_HPRT register to determine the exact event that caused 
   this interrupt. The application must clear the appropriate status bit 
   in the OTG_FS_HPRT register to clear this bit.
   Note: Only accessible in host mode. */

/* [23..22] Reserved */


/* Bit 21 - Incomplete periodic transfer */
#define OTG_FS_IPXFR (1 << 21)
/* In host mode, the core sets this interrupt bit when there are 
   incomplete periodic transactions still pending, which are scheduled 
   for the current frame. */

/* Bit 21 - Incomplete isochronous OUT transfer */
#define OTG_FS_INCOMPISOOUT (1 << 21)
/* In device mode, the core sets this interrupt to indicate that there 
   is at least one isochronous OUT endpoint on which the transfer is 
   not completed in the current frame. This interrupt is asserted along 
   with the End of periodic frame interrupt (EOPF) bit in this register. */

/* Bit 20 - Incomplete isochronous IN transfer */
#define OTG_FS_IISOIXFR (1 << 20)
/* The core sets this interrupt to indicate that there is at least one 
   isochronous IN endpoint on which the transfer is not completed in the 
   current frame. This interrupt is asserted along with the End of 
   periodic frame interrupt (EOPF) bit in this register.
   Note: Only accessible in device mode. */

