bobmittmann/thinkos/sdk/include/stm32f/stm32f-otg_fs.h
/* Bit 19 - OUT endpoint interrupt */
#define OTG_FS_OEPINT (1 << 19)
/* The core sets this bit to indicate that an interrupt is pending on 
   one of the OUT endpoints of the core (in device mode). The 
   application must read the OTG_FS_DAINT register to determine the 
   exact number of the OUT endpoint on which the interrupt occurred, 
   and then read the corresponding OTG_FS_DOEPINTx register to 
   determine the exact cause of the interrupt. The application must 
   clear the appropriate status bit in the corresponding OTG_FS_DOEPINTx 
   register to clear this bit.
   Note: Only accessible in device mode. */

/* Bit 18 - IN endpoint interrupt */
#define OTG_FS_IEPINT (1 << 18)
/* The core sets this bit to indicate that an interrupt is pending on 
   one of the IN endpoints of the core (in device mode). The application 
   must read the OTG_FS_DAINT register to determine the exact number of 
   the IN endpoint on which the interrupt occurred, and then read the
   corresponding OTG_FS_DIEPINTx register to determine the exact cause of 
   the interrupt. The application must clear the appropriate status bit 
   in the corresponding OTG_FS_DIEPINTx register to clear this bit.
   Note: Only accessible in device mode. */

/* [17..16] Reserved */


/* Bit 15 - End of periodic frame interrupt */
#define OTG_FS_EOPF (1 << 15)
/* Indicates that the period specified in the periodic frame interval 
   field of the OTG_FS_DCFG register (PFIVL bit in OTG_FS_DCFG) has 
   been reached in the current frame.
   Note: Only accessible in device mode. */

/* Bit 14 - Isochronous OUT packet dropped interrupt */
#define OTG_FS_ISOODRP (1 << 14)
/* The core sets this bit when it fails to write an isochronous OUT 
   packet into the RxFIFO because the RxFIFO does not have enough 
   space to accommodate a maximum size packet for the isochronous 
   OUT endpoint.
   Note: Only accessible in device mode. */

/* Bit 13 - Enumeration done */
#define OTG_FS_ENUMDNE (1 << 13)
/* The core sets this bit to indicate that speed enumeration is 
   complete. The application must read the OTG_FS_DSTS register to 
   obtain the enumerated speed.
   Note: Only accessible in device mode. */

/* Bit 12 - USB reset */
#define OTG_FS_USBRST (1 << 12)
/* The core sets this bit to indicate that a reset is detected on the USB.
   Note: Only accessible in device mode. */

/* Bit 11 - USB suspend */
#define OTG_FS_USBSUSP (1 << 11)
/* The core sets this bit to indicate that a suspend was detected on the 
   USB. The core enters the Suspended state when there is no activity on 
   the data lines for a period of 3 ms.
   Note: Only accessible in device mode. */

/* Bit 10 - Early suspend */
#define OTG_FS_ESUSP (1 << 10)
/* The core sets this bit to indicate that an Idle state has been 
   detected on the USB for 3 ms.
   Note: Only accessible in device mode. */

/* [9..8] Reserved */


/* Bit 7 - Global OUT NAK effective */
#define OTG_FS_GONAKEFF (1 << 7)
/* Indicates that the Set global OUT NAK bit in the OTG_FS_DCTL register 
   (SGONAK bit in OTG_FS_DCTL), set by the application, has taken effect 
   in the core. This bit can be cleared by writing the Clear global OUT 
   NAK bit in the OTG_FS_DCTL register (CGONAK bit in OTG_FS_DCTL).
   Note: Only accessible in device mode. */

/* Bit 6 - Global IN non-periodic NAK effective */
#define OTG_FS_GINAKEFF (1 << 6)
/* Indicates that the Set global non-periodic IN NAK bit in the 
   OTG_FS_DCTL register (SGINAK bit in OTG_FS_DCTL), set by the 
   application, has taken effect in the core. That is, the core has 
   sampled the Global IN NAK bit set by the application. This bit can 
   be cleared by clearing the Clear global non-periodic IN NAK bit in 
   the OTG_FS_DCTL register (CGINAK bit in OTG_FS_DCTL).
   This interrupt does not necessarily mean that a NAK handshake is sent 
   out on the USB. The STALL bit takes precedence over the NAK bit.
   Note: Only accessible in device mode. */

/* Bit 5 - Non-periodic TxFIFO empty */
#define OTG_FS_NPTXFE (1 << 5)
/* This interrupt is asserted when the non-periodic TxFIFO is either 
   half or completely empty, and there is space for at least one entry 
   to be written to the non-periodic transmit request queue. The half or 
   completely empty status is determined by the non-periodic TxFIFO 
   empty level bit in the OTG_FS_GAHBCFG register (TXFELVL bit 
   in OTG_FS_GAHBCFG).
   Note: Accessible in host mode only. */

/* Bit 4 - RxFIFO non-empty */
#define OTG_FS_RXFLVL (1 << 4)
/* Indicates that there is at least one packet pending to be read from 
   the RxFIFO.
   Note: Accessible in both host and device modes. */

/* Bit 3 - Start of frame */
#define OTG_FS_SOF (1 << 3)
/* In host mode, the core sets this bit to indicate that an SOF (FS), 
   or Keep-Alive (LS) is transmitted on the USB. The application must 
   write a 1 to this bit to clear the interrupt. In device mode, in the 
   core sets this bit to indicate that an SOF token has been received on 
   the USB. The application can read the Device Status register to get 
   the current frame number.
   This interrupt is seen only when the core is operating in FS.
   Note: Accessible in both host and device modes. */

/* Bit 2 - OTG interrupt */
#define OTG_FS_OTGINT (1 << 2)
/* The core sets this bit to indicate an OTG protocol event. The 
   application must read the OTG Interrupt Status (OTG_FS_GOTGINT) 
   register to determine the exact event that caused this interrupt. 
   The application must clear the appropriate status bit in the 
   OTG_FS_GOTGINT register to clear this bit.
   Note: Accessible in both host and device modes. */

/* Bit 1 - Mode mismatch interrupt */
#define OTG_FS_MMIS (1 << 1)
/* The core sets this bit when the application is trying to access:
   A host mode register, when the core is operating in device mode
   A device mode register, when the core is operating in host mode
   The register access is completed on the AHB with an OKAY response, 
   but is ignored by the core internally and does not affect the 
   operation of the core.
   Note: Accessible in both host and device modes. */

