bobmittmann/thinkos/sdk/include/stm32f/stm32f-otg_fs.h
/* Bit 0 - Current mode of operation */
#define OTG_FS_CMOD (1 << 0)
/* Indicates the current mode.
   0: Device mode
   1  : Host mode
   Note: Accessible in both host and device modes. */



/* -------------------------------------------------------------------------
 * OTG_FS interrupt mask register */
#define STM32F_OTG_FS_GINTMSK 0x018


/* Bit 31 - Resume/remote wakeup detected interrupt mask */
#define OTG_FS_WUIM (1 << 31)
/* 0: Masked interrupt
   1: Unmasked interrupt
   Note: Accessible in both host and device modes. */

/* Bit 30 - Session request/new session detected interrupt mask */
#define OTG_FS_SRQIM (1 << 30)
/* 0: Masked interrupt
   1: Unmasked interrupt
   Note: Accessible in both host and device modes. */

/* Bit 29 - Disconnect detected interrupt mask */
#define OTG_FS_DISCINT (1 << 29)
/* 0: Masked interrupt
   1: Unmasked interrupt
   Note: Only accessible in device mode. */

/* Bit 28 - Connector ID status change mask */
#define OTG_FS_CIDSCHGM (1 << 28)
/* 0: Masked interrupt
   1: Unmasked interrupt
   Note: Accessible in both host and device modes. */

/* Bit 27 - LPM interrupt mask */
#define OTG_FS_LPMINTM (1 << 27)
/* 0: Masked interrupt
   1: Unmasked interrupt
   Note: Accessible in both host and device modes. */

/* Bit 26 - Periodic TxFIFO empty mask */
#define OTG_FS_PTXFEM (1 << 26)
/* 0: Masked interrupt
   1: Unmasked interrupt
   Note: Only accessible in host mode. */

/* Bit 25 - Host channels interrupt mask */
#define OTG_FS_HCIM (1 << 25)
/* 0: Masked interrupt
   1: Unmasked interrupt
   Note: Only accessible in host mode. */

/* Bit 24 - Host port interrupt mask */
#define OTG_FS_PRTIM (1 << 24)
/* 0: Masked interrupt
   1: Unmasked interrupt
   Note: Only accessible in host mode. */

/* Bit 23 - Reset detected interrupt mask */
#define OTG_FS_RSTDETM (1 << 23)
/* 0: Masked interrupt
   1: Unmasked interrupt
   Note: Only accessible in device mode. */

/* Bit 21 - Incomplete periodic transfer mask */
#define OTG_FS_IPXFRM (1 << 21)
/* 0: Masked interrupt
   1: Unmasked interrupt
   Note: Only accessible in host mode. */

/* Bit 21 - Incomplete isochronous OUT transfer mask */
#define OTG_FS_IISOOXFRM (1 << 21)
/* 0: Masked interrupt
   1: Unmasked interrupt
   Note: Only accessible in device mode. */

/* Bit 20 - Incomplete isochronous IN transfer mask */
#define OTG_FS_IISOIXFRM (1 << 20)
/* 0: Masked interrupt
   1: Unmasked interrupt
   Note: Only accessible in device mode. */

/* Bit 19 - OUT endpoints interrupt mask */
#define OTG_FS_OEPINTM (1 << 19)
/* 0: Masked interrupt
   1: Unmasked interrupt
   Note: Only accessible in device mode. */

/* Bit 18 - IN endpoints interrupt mask */
#define OTG_FS_IEPINTM (1 << 18)
/* 0: Masked interrupt
   1: Unmasked interrupt
   Note: Only accessible in device mode. */

/* Bit 17 - Endpoint mismatch interrupt mask */
#define OTG_FS_EPMISM (1 << 17)
/* 0: Masked interrupt
   1: Unmasked interrupt
   Note: Only accessible in device mode. */

/* Bit 16 Reserved */

/* Bit 15 - End of periodic frame interrupt mask */
#define OTG_FS_EOPFM (1 << 15)
/* 0: Masked interrupt
   1: Unmasked interrupt
   Note: Only accessible in device mode. */

/* Bit 14 - Isochronous OUT packet dropped interrupt mask */
#define OTG_FS_ISOODRPM (1 << 14)
/* 0: Masked interrupt
   1: Unmasked interrupt
   Note: Only accessible in device mode. */

/* Bit 13 - Enumeration done mask */
#define OTG_FS_ENUMDNEM (1 << 13)
/* 0: Masked interrupt
   1: Unmasked interrupt
   Note: Only accessible in device mode. */

/* Bit 12 - USB reset mask */
#define OTG_FS_USBRSTM (1 << 12)
/* 0: Masked interrupt
   1: Unmasked interrupt
   Note: Only accessible in device mode. */

/* Bit 11 - USB suspend mask */
#define OTG_FS_USBSUSPM (1 << 11)
/* 0: Masked interrupt
   1: Unmasked interrupt
   Note: Only accessible in device mode. */

/* Bit 10 - Early suspend mask */
#define OTG_FS_ESUSPM (1 << 10)
/* 0: Masked interrupt
   1: Unmasked interrupt
   Note: Only accessible in device mode. */

/* [9..8] Reserved. */

/* Bit 7 - Global OUT NAK effective mask */
#define OTG_FS_GONAKEFFM (1 << 7)
/* 0: Masked interrupt
   1: Unmasked interrupt
   Note: Only accessible in device mode. */

/* Bit 6 - Global non-periodic IN NAK effective mask */
#define OTG_FS_GINAKEFFM (1 << 6)
/* 0: Masked interrupt
   1: Unmasked interrupt
   Note: Only accessible in device mode. */

/* Bit 5 - Non-periodic TxFIFO empty mask */
#define OTG_FS_NPTXFEM (1 << 5)
/* 0: Masked interrupt
   1: Unmasked interrupt
   Note: Only accessible in Host mode. */

/* Bit 4 - Receive FIFO non-empty mask */
#define OTG_FS_RXFLVLM (1 << 4)
/* 0: Masked interrupt
   1: Unmasked interrupt
   Note: Accessible in both device and host modes. */

/* Bit 3 - Start of frame mask */
#define OTG_FS_SOFM (1 << 3)
/* 0: Masked interrupt
   1: Unmasked interrupt
   Note: Accessible in both device and host modes. */

/* Bit 2 - OTG interrupt mask */
#define OTG_FS_OTGINT (1 << 2)
/* 0: Masked interrupt
   1: Unmasked interrupt
   Note: Accessible in both device and host modes. */

/* Bit 1 - Mode mismatch interrupt mask */
#define OTG_FS_MMISM (1 << 1)
/* 0: Masked interrupt
   1: Unmasked interrupt
   Note: Accessible in both device and host modes. */

/* Bit 0 Reserved */

/* -------------------------------------------------------------------------
 * OTG_FS Receive status debug read/OTG status read and pop registers
 * (OTG_FS_GRXSTSR/OTG_FS_GRXSTSP)
 * Address offset for Read: 0x01C
 * Address offset for Pop: 0x020 */
#define STM32F_OTG_FS_GRXSTSR 0x01c
#define STM32F_OTG_FS_GRXSTSP 0x020

/* [31..21] Reserved */

/* Bits [20..17] - Packet status */
#define OTG_FS_PKTSTS ((20 - 17) << 17)
/* Indicates the status of the received packet
   0010: IN data packet received
   0011: IN transfer completed (triggers an interrupt)
   0101: Data toggle error (triggers an interrupt)
   0111: Channel halted (triggers an interrupt)
   Others: Reserved */

/* Bits [16..15] - Data PID */
#define OTG_FS_DPIDX ((16 - 15) << 15)
#define OTG_FS_DPID_MSK (((1 << (16 - 15 + 1)) - 1) << 15)
#define OTG_FS_DPID_GET(REG) (((REG) & OTG_FS_DPID_MSK) >> 15)
#define OTG_FS_DPID_DATA0 (0 << 15)
#define OTG_FS_DPID_DATA1 (1 << 15)
#define OTG_FS_DPID_DATA2 (2 << 15)
#define OTG_FS_DPID_MDATA (3 << 15)
/* Indicates the Data PID of the received packet
   00: DATA0
   10: DATA1
   01: DATA2
   11: MDATA */

/* Bits [14..4] - Byte count */
#define OTG_FS_BCNT ((14 - 4) << 4)
#define OTG_FS_BCNT_MSK (((1 << (14 - 4 + 1)) - 1) << 4)
#define OTG_FS_BCNT_SET(VAL) (((VAL) << 4) & OTG_FS_BCNT_MSK)
#define OTG_FS_BCNT_GET(REG) (((REG) & OTG_FS_BCNT_MSK) >> 4)
/* Indicates the byte count of the received IN data packet. */

/* Bits [3..0] - Channel number */
#define OTG_FS_CHNUM ((3 - 0) << 0)
#define OTG_FS_CHNUM_MSK (((1 << (3 - 0 + 1)) - 1) << 0)
#define OTG_FS_CHNUM_SET(VAL) (((VAL) << 0) & OTG_FS_CHNUM_MSK)
#define OTG_FS_CHNUM_GET(REG) (((REG) & OTG_FS_CHNUM_MSK) >> 0)
/* Indicates the channel number to which the current received 
   packet belongs. */



/* [31..25] Reserved */

/* Bits [24..21] - Frame number */
#define OTG_FS_FRMNUM ((24 - 21) << 21)
/* This is the least significant 4 bits of the frame number in which the 
   packet is received on the USB. This field is supported only when 
   isochronous OUT endpoints are supported. */

/* Bits [20..17] - Packet status */
#define OTG_FS_PKTSTS ((20 - 17) << 17)
#define OTG_FS_PKTSTS_MSK (((1 << (20 - 17 + 1)) - 1) << 17)
#define OTG_FS_PKTSTS_SET(VAL) (((VAL) << 17) & OTG_FS_PKTSTS_MSK)
#define OTG_FS_PKTSTS_GET(REG) (((REG) & OTG_FS_PKTSTS_MSK) >> 17)

#define OTG_FS_PKTSTS_GOUT_NACK  (0x1 << 17)
#define OTG_FS_PKTSTS_OUT_DATA_UPDT  (0x2 << 17)
#define OTG_FS_PKTSTS_OUT_XFER_COMP  (0x3 << 17)
#define OTG_FS_PKTSTS_SETUP_COMP (0x4 << 17)
#define OTG_FS_PKTSTS_SETUP_UPDT (0x6 << 17)
/* Indicates the status of the received packet
   0001: Global OUT NAK (triggers an interrupt)
   0010: OUT data packet received
   0011: OUT transfer completed (triggers an interrupt)
   0100: SETUP transaction completed (triggers an interrupt)
   0110: SETUP data packet received
   Others: Reserved */

/* Bits [16..15] - Data PID */
#define OTG_FS_DPID_STAT ((16 - 15) << 15)
/* Indicates the Data PID of the received OUT data packet
   00: DATA0
   10: DATA1
   01: DATA2
   11: MDATA */

/* Bits [14..4] - Byte count */
#define OTG_FS_BCNT ((14 - 4) << 4)
/* Indicates the byte count of the received data packet. */

/* Bits [3..0] - Endpoint number */
#define _OTG_FS_EPNUM ((3 - 0) << 0)
#define OTG_FS_EPNUM_MSK (((1 << (3 - 0 + 1)) - 1) << 0)
#define OTG_FS_EPNUM_SET(VAL) (((VAL) << 0) & OTG_FS_EPNUM_MSK)
#define OTG_FS_EPNUM_GET(REG) (((REG) & OTG_FS_EPNUM_MSK) >> 0)
/* Indicates the endpoint number to which the current received 
   packet belongs. */


/* -------------------------------------------------------------------------
 * OTG_FS Receive FIFO size register */
#define STM32F_OTG_FS_GRXFSIZ 0x024

