bobmittmann/thinkos/sdk/include/stm32f/stm32f-otg_fs.h
/* [31..16] Reserved */

/* Bits [15..0] - RxFIFO depth */
#define OTG_FS_RXFD ((15 - 0) << 0)
/* This value is in terms of 32-bit words.
   Minimum value is 16
   Maximum value is 256
   The power-on reset value of this register is specified as the largest 
   Rx data FIFO depth. */

/* -------------------------------------------------------------------------
 * OTG_FS Host non-periodic transmit FIFO size register */
#define STM32F_OTG_FS_HNPTXFSIZ 0x028

/* Bits [31..16] - Non-periodic TxFIFO depth */
#define OTG_FS_NPTXFD ((31 - 16) << 16)
/* This value is in terms of 32-bit words.
   Minimum value is 16
   Maximum value is 256 */

/* Bits [15..0] - Non-periodic transmit RAM start address */
#define OTG_FS_NPTXFSA ((15 - 0) << 0)
/* This field contains the memory start address for non-periodic 
   transmit FIFO RAM.
   Device mode */

/* -------------------------------------------------------------------------
 * Endpoint 0 Transmit FIFO size register */
#define STM32F_OTG_FS_DIEPTXF0 0x028 

/* Bits [31..16] - Endpoint 0 TxFIFO depth */
#define OTG_FS_TX0FD ((31 - 16) << 16)
#define OTG_FS_TX0FD_MSK (((1 << (31 - 16 + 1)) - 1) << 16)
#define OTG_FS_TX0FD_SET(VAL) (((VAL) << 16) & OTG_FS_TX0FD_MSK)
#define OTG_FS_TX0FD_GET(REG) (((REG) & OTG_FS_TX0FD_MSK) >> 16)
/* This value is in terms of 32-bit words.
   Minimum value is 16
   Maximum value is 256 */

/* Bits [15..0] - Endpoint 0 transmit RAM start address */
#define OTG_FS_TX0FSA ((15 - 0) << 0)
#define OTG_FS_TX0FSA_MSK (((1 << (15 - 0 + 1)) - 1) << 0)
#define OTG_FS_TX0FSA_SET(VAL) (((VAL) << 0) & OTG_FS_TX0FSA_MSK)
#define OTG_FS_TX0FSA_GET(REG) (((REG) & OTG_FS_TX0FSA_MSK) >> 0)
/* This field contains the memory start address for the endpoint 0 
   transmit FIFO RAM. */


/* OTG_FS non-periodic transmit FIFO/queue status register */
#define STM32F_OTG_FS_HNPTXSTS 0x02C

/* Bits [30..24] - Top of the non-periodic transmit request queue */
#define OTG_FS_NPTXQTOP ((30 - 24) << 24)
/* Entry in the non-periodic Tx request queue that is currently being 
   processed by the MAC.
   Bits [30:27]: Channel/endpoint number
   Bits [26:25]:
   – 00: IN/OUT token
   – 01: Zero-length transmit packet (device IN/host OUT)
   – 11: Channel halt command
   Bit [24]: Terminate (last entry for selected channel/endpoint) */

/* Bits [23..16] - Non-periodic transmit request queue space available */
#define OTG_FS_NPTQXSAV ((23 - 16) << 16)
/* Indicates the amount of free space available in the non-periodic 
   transmit request queue. This queue holds both IN and OUT requests 
   in host mode. Device mode has only IN requests.
   00: Non-periodic transmit request queue is full
   01: dx1 location available
   10: dx2 locations available
   bxn: dxn locations available (0 ≤ n ≤ dx8) Others: Reserved */

/* Bits [15..0] - Non-periodic TxFIFO space available */
#define OTG_FS_NPTXFSAV ((15 - 0) << 0)
/* Indicates the amount of free space available in the non-periodic TxFIFO.
   Values are in terms of 32-bit words.
   00: Non-periodic TxFIFO is full
   01: dx1 word available
   10: dx2 words available
   0xn: dxn words available (where 0 ≤ n ≤ dx256)
   Others: Reserved */


/* -------------------------------------------------------------------------
 * OTG_FS general core configuration register */
#define STM32F_OTG_FS_GCCFG 0x038


/* [31..22] Reserved */


#define OTG_FS_VBDEN (1 << 21)
/* Enables VBUS sensing comparators to detect VBUS valid levels on the VBUS PAD for USB host and device operation. If HNP and/or SRP support is enabled, VBUS comparators are automatically enabled independently of VBDEN value.
0 = VBUS Detection Disabled
1 = VBUS Detection Enabled */

/* Bit 21 - VBUS sensing disable option */
#define OTG_FS_NOVBUSSENS (1 << 21)
/* When this bit is set, VBUS is considered internally to be always at 
   VBUS valid level (5 V). This option removes the need for a dedicated 
   VBUS pad, and leave this pad free to be used for other purposes such as 
   a shared functionality. VBUS connection can be remapped on another 
   general purpose input pad and monitored by software.
   This option is only suitable for host-only or device-only applications.
   0: VBUS sensing available by hardware
   1: VBUS sensing not available by hardware. */

/* Bit 20 - SOF output enable */
#define OTG_FS_SOFOUTEN (1 << 20)
/* 0: SOF pulse not available on PAD
   1: SOF pulse available on PAD */

/* Bit 19 - Enable the VBUS sensing “B” device */
#define OTG_FS_VBUSBSEN (1 << 19)
/* 0: VBUS sensing “B” disabled
   1: VBUS sensing “B” enabled */

/* Bit 18 - Enable the VBUS sensing “A” device */
#define OTG_FS_VBUSASEN (1 << 18)
/* 0: VBUS sensing “A” disabled
   1: VBUS sensing “A” enabled */

/* Bit 17 Reserved */


/* Bit 16 - Power down */
#define OTG_FS_PWRDWN (1 << 16)
/* Used to activate the transceiver in transmission/reception
  0: Power down active
  1: Power down deactivated (“Transceiver active”) */

/* [15..0] Reserved. */


/* -------------------------------------------------------------------------
 * OTG_FS core ID register */
#define STM32F_OTG_FS_CID 0x03C

/* Bits [31..0] - Product ID field */
#define OTG_FS_PRODUCT_ID ((31 - 0) << 0)
/* Application-programmable ID field. */


/* -------------------------------------------------------------------------
 * OTG_FS Host periodic transmit FIFO size register */
#define STM32F_OTG_FS_HPTXFSIZ 0x100


/* Bits [31..16] - Host periodic TxFIFO depth */
#define OTG_FS_PTXFD ((31 - 16) << 16)
#define OTG_FS_PTXFD ((31 - 16) << 16)
#define OTG_FS_PTXFD_MSK (((1 << (31 - 16 + 1)) - 1) << 16)
#define OTG_FS_PTXFD_SET(VAL) (((VAL) << 16) & OTG_FS_PTXFD_MSK)
#define OTG_FS_PTXFD_GET(REG) (((REG) & OTG_FS_PTXFD_MSK) >> 16)
/* This value is in terms of 32-bit words.
   Minimum value is 16 */

/* Bits [15..0] - Host periodic TxFIFO start address */
#define OTG_FS_PTXSA ((15 - 0) << 0)
#define OTG_FS_PTXFSA_MSK (((1 << (15 - 0 + 1)) - 1) << 0)
#define OTG_FS_PTXFSA_SET(VAL) (((VAL) << 0) & OTG_FS_PTXFSA_MSK)
#define OTG_FS_PTXFSA_GET(REG) (((REG) & OTG_FS_PTXFSA_MSK) >> 0)
/* The power-on reset value of this register is the sum of the largest 
   Rx data FIFO depth and largest non-periodic Tx data FIFO depth. */


/* -------------------------------------------------------------------------
 * OTG_FS device IN endpoint transmit FIFO size register (OTG_FS_DIEPTXFx)
 * (x = 1..3, where x is the FIFO_number)
 * Address offset: 0x104 + (FIFO_number – 1) × 0x04 */
#define OTG_FS_DIEPTXF1 (0x104 + (1 – 1) × 0x04)
#define OTG_FS_DIEPTXF2 (0x104 + (2 – 1) × 0x04)
#define OTG_FS_DIEPTXF3 (0x104 + (3 – 1) × 0x04)

/* Bits [31..16] - IN endpoint TxFIFO depth */
#define OTG_FS_INEPTXFD ((31 - 16) << 16)
#define OTG_FS_INEPTXFD_MSK (((1 << (31 - 16 + 1)) - 1) << 16)
#define OTG_FS_INEPTXFD_SET(VAL) (((VAL) << 16) & OTG_FS_INEPTXFD_MSK)
#define OTG_FS_INEPTXFD_GET(REG) (((REG) & OTG_FS_INEPTXFD_MSK) >> 16)
/* This value is in terms of 32-bit words.
   Minimum value is 16
   The power-on reset value of this register is specified as the 
   largest IN endpoint FIFO number depth. */

