bobmittmann/thinkos/sdk/include/stm32f/stm32f-otg_fs.h
/* Bits [15..0] - IN endpoint FIFOx transmit RAM start address */
#define OTG_FS_INEPTXSA ((15 - 0) << 0)
#define OTG_FS_INEPTXSA_MSK (((1 << (15 - 0 + 1)) - 1) << 0)
#define OTG_FS_INEPTXSA_SET(VAL) (((VAL) << 0) & OTG_FS_INEPTXSA_MSK)
#define OTG_FS_INEPTXSA_GET(REG) (((REG) & OTG_FS_INEPTXSA_MSK) >> 0)
/* This field contains the memory start address for IN endpoint 
   transmit FIFOx. */


/* -------------------------------------------------------------------------
 * OTG_FS Host configuration register */
#define STM32F_OTG_FS_HCFG 0x400
/* This register configures the core after power-on. Do not make changes 
   to this register after initializing the host. */

/* [31..3] Reserved */


/* Bit 2 - FS- and LS-only support */
#define OTG_FS_FSLSS (1 << 2)
/* 
The application uses this bit to control the core’s enumeration speed. Using this bit, the
application can make the core enumerate as an FS host, even if the connected device
supports HS traffic. Do not make changes to this field after initial programming.
1: FS/LS-only, even if the connected device can support HS (read-only) */

/* Bits [1..0] - FS/LS PHY clock select */
#define OTG_FS_FSLSPCS ((1 - 0) << 0)
/* 
When the core is in FS host mode
01: PHY clock is running at 48 MHz
Others: Reserved
When the core is in LS host mode
00: Reserved
01: Select 48 MHz PHY clock frequency
10: Select 6 MHz PHY clock frequency
11: Reserved
Note: The FSLSPCS must be set on a connection event according to the speed of the
connected device (after changing this bit, a software reset must be performed). */

/* OTG_FS Host frame interval register */
#define STM32F_OTG_FS_HFIR 0x404



/* [31..16] Reserved */


/* Bits [15..0] - Frame interval */
#define OTG_FS_FRIVL ((15 - 0) << 0)
/* 
The value that the application programs to this field specifies the interval between two
consecutive SOFs (FS) or Keep-Alive tokens (LS). This field contains the number of PHY
clocks that constitute the required frame interval. The application can write a value to this
register only after the Port enable bit of the host port control and status register (PENA bit in
OTG_FS_HPRT) has been set. If no value is programmed, the core calculates the value based
on the PHY clock specified in the FS/LS PHY Clock Select field of the host configuration
register (FSLSPCS in OTG_FS_HCFG). Do not change the value of this field after the initial
configuration.
1 ms × (PHY clock frequency) */

/* OTG_FS Host frame number/frame time remaining register */
#define STM32F_OTG_FS_HFNUM 0x408



/* Bits [31..16] - Frame time remaining */
#define OTG_FS_FTREM ((31 - 16) << 16)
/* 
Indicates the amount of time remaining in the current frame, in terms of PHY clocks. This field
decrements on each PHY clock. When it reaches zero, this field is reloaded with the value in
the Frame interval register and a new SOF is transmitted on the USB. */

/* Bits [15..0] - Frame number */
#define OTG_FS_FRNUM ((15 - 0) << 0)
/* 
This field increments when a new SOF is transmitted on the USB, and is cleared to 0 when it
reaches 0x3FFF. */

/* OTG_FS_Host periodic transmit FIFO/queue status register */
#define OTG_FS_HPTXSTS  0x410


/* Bits [31..24] - Top of the periodic transmit request queue */
#define OTG_FS_PTXQTOP ((31 - 24) << 24)
/* 
This indicates the entry in the periodic Tx request queue that is currently being processed by
the MAC.
This register is used for debugging.
Bit [31]: Odd/Even frame
–
0: send in even frame
–
1: send in odd frame
Bits [30:27]: Channel/endpoint number
Bits [26:25]: Type
–
00: IN/OUT
–
01: Zero-length packet
–
11: Disable channel command
Bit [24]: Terminate (last entry for the selected channel/endpoint) */

/* Bits [23..16] - Periodic transmit request queue space available */
#define OTG_FS_PTXQSAV ((23 - 16) << 16)
/* 
Indicates the number of free locations available to be written in the periodic transmit request
queue. This queue holds both IN and OUT requests.
00: Periodic transmit request queue is full
01: dx1 location available
10: dx2 locations available
bxn: dxn locations available (0 ≤ dxn ≤ 8)
Others: Reserved */

/* Bits [15..0] - Periodic transmit data FIFO space available */
#define OTG_FS_PTXFSAVL ((15 - 0) << 0)
/* 
Indicates the number of free locations available to be written to in the periodic TxFIFO.
Values are in terms of 32-bit words
0000: Periodic TxFIFO is full
0001: dx1 word available
0010: dx2 words available
bxn: dxn words available (where 0 ≤ dxn ≤ PTXFD)
Others: Reserved */

/* OTG_FS Host all channels interrupt register */
#define STM32F_OTG_FS_HAINT 0x414



/* [31..16] Reserved */


/* Bits [15..0] - Channel interrupts */
#define OTG_FS_HAINT ((15 - 0) << 0)
/* 
One bit per channel: Bit 0 for Channel 0, bit 15 for Channel 15 */

/* OTG_FS Host all channels interrupt mask register */
#define STM32F_OTG_FS_HAINTMSK 0x418



/* [31..16] Reserved */


/* Bits [15..0] - Channel interrupt mask */
#define OTG_FS_HAINTM ((15 - 0) << 0)
/* 
0: Masked interrupt
1: Unmasked interrupt
One bit per channel: Bit 0 for channel 0, bit 15 for channel 15 */

/* OTG_FS Host port control and status register */
#define STM32F_OTG_FS_HPRT 0x440



/* [31..19] Reserved */


/* Bits [18..17] - Port speed */
#define OTG_FS_PSPD ((18 - 17) << 17)
/* 
Indicates the speed of the device attached to this port.
01: Full speed
10: Low speed
11: Reserved */

/* Bits [16..13] - Port test control */
#define OTG_FS_PTCTL ((16 - 13) << 13)
/* 
The application writes a nonzero value to this field to put the port into a Test mode, and the
corresponding pattern is signaled on the port.
0000: Test mode disabled
0001: Test_J mode
0010: Test_K mode
0011: Test_SE0_NAK mode
0100: Test_Packet mode
0101: Test_Force_Enable
Others: Reserved */

/* Bit 12 - Port power */
#define OTG_FS_PPWR (1 << 12)
/* 
The application uses this field to control power to this port, and the core clears this bit on an
overcurrent condition.
0: Power off
1: Power on */

/* Bits [11..10] - Port line status */
#define OTG_FS_PLSTS ((11 - 10) << 10)
/* 
Indicates the current logic level USB data lines
Bit [10]: Logic level of OTG_FS_FS_DP
Bit [11]: Logic level of OTG_FS_FS_DM */

/* Bit 9 Reserved */


