bobmittmann/thinkos/sdk/include/stm32f/stm32f-otg_fs.h
/* Bit 8 - Port reset */
#define OTG_FS_PRST (1 << 8)
/* 
When the application sets this bit, a reset sequence is started on this port. The application
must time the reset period and clear this bit after the reset sequence is complete.
0: Port not in reset
1: Port in reset
The application must leave this bit set for a minimum duration of at least 10 ms to start a reset
on the port. The application can leave it set for another 10 ms in addition to the required
minimum duration, before clearing the bit, even though there is no maximum limit set by the
USB standard. */

/* Bit 7 - Port suspend */
#define OTG_FS_PSUSP (1 << 7)
/* 
The application sets this bit to put this port in Suspend mode. The core only stops sending
SOFs when this is set. To stop the PHY clock, the application must set the Port clock stop bit,
which asserts the suspend input pin of the PHY.
The read value of this bit reflects the current suspend status of the port. This bit is cleared by
the core after a remote wakeup signal is detected or the application sets the Port reset bit or
Port resume bit in this register or the Resume/remote wakeup detected interrupt bit or
Disconnect detected interrupt bit in the Core interrupt register (WKUINT or DISCINT in
OTG_FS_GINTSTS, respectively).
0: Port not in Suspend mode
1: Port in Suspend mode */

/* Bit 6 - Port resume */
#define OTG_FS_PRES (1 << 6)
/* 
The application sets this bit to drive resume signaling on the port. The core continues to drive
the resume signal until the application clears this bit.
If the core detects a USB remote wakeup sequence, as indicated by the Port resume/remote
wakeup detected interrupt bit of the Core interrupt register (WKUINT bit in
OTG_FS_GINTSTS), the core starts driving resume signaling without application intervention
and clears this bit when it detects a disconnect condition. The read value of this bit indicates
whether the core is currently driving resume signaling.
0: No resume driven
1: Resume driven */

/* Bit 5 - Port overcurrent change */
#define OTG_FS_POCCHNG (1 << 5)
/* 
The core sets this bit when the status of the Port overcurrent active bit (bit 4) in this register
changes. */

/* Bit 4 - Port overcurrent active */
#define OTG_FS_POCA (1 << 4)
/* 
Indicates the overcurrent condition of the port.
0: No overcurrent condition
1: Overcurrent condition */

/* Bit 3 - Port enable/disable change */
#define OTG_FS_PENCHNG (1 << 3)
/* 
The core sets this bit when the status of the Port enable bit [2] in this register changes. */

/* Bit 2 - Port enable */
#define OTG_FS_PENA (1 << 2)
/* 
A port is enabled only by the core after a reset sequence, and is disabled by an overcurrent
condition, a disconnect condition, or by the application clearing this bit. The application cannot
set this bit by a register write. It can only clear it to disable the port. This bit does not trigger
any interrupt to the application.
0: Port disabled
1: Port enabled */

/* Bit 1 - Port connect detected */
#define OTG_FS_PCDET (1 << 1)
/* 
The core sets this bit when a device connection is detected to trigger an interrupt to the
application using the host port interrupt bit in the Core interrupt register (HPRTINT bit in
OTG_FS_GINTSTS). The application must write a 1 to this bit to clear the interrupt. */

/* Bit 0 - Port connect status */
#define OTG_FS_PCSTS (1 << 0)
/* 
0: No device is attached to the port
1: A device is attached to the port
OTG_FS Host channel-x characteristics register (OTG_FS_HCCHARx)
(x = 0..7, where x = Channel_number)
Address offset: 0x500 + (Channel_number × 0x20) */


/* Bit 31 - Channel enable */
#define OTG_FS_CHENA (1 << 31)
/* 
This field is set by the application and cleared by the OTG host.
0: Channel disabled
1: Channel enabled */

/* Bit 30 - Channel disable */
#define OTG_FS_CHDIS (1 << 30)
/* 
The application sets this bit to stop transmitting/receiving data on a channel, even before the
transfer for that channel is complete. The application must wait for the Channel disabled
interrupt before treating the channel as disabled. */

/* Bit 29 - Odd frame */
#define OTG_FS_ODDFRM (1 << 29)
/* 
This field is set (reset) by the application to indicate that the OTG host must perform a transfer
in an odd frame. This field is applicable for only periodic (isochronous and interrupt)
transactions.
0: Even frame
1: Odd frame */

/* Bits [28..22] - Device address */
#define _OTG_FS_DAD ((28 - 22) << 22)
/* 
This field selects the specific device serving as the data source or sink. */

/* Bits [21..20] - Multicount */
#define _OTG_FS_MCNT ((21 - 20) << 20)
/* 
This field indicates to the host the number of transactions that must be executed per frame for
this periodic endpoint. For non-periodic transfers, this field is not used
00: Reserved. This field yields undefined results
01: 1 transaction
10: 2 transactions per frame to be issued for this endpoint
11: 3 transactions per frame to be issued for this endpoint
Note: This field must be set to at least 01. */

/* Bits [19..18] - Endpoint type */
#define OTG_FS_EPTYP ((19 - 18) << 18)
/* 
Indicates the transfer type selected.
00: Control
01: Isochronous
10: Bulk
11: Interrupt */

/* Bit 17 - Low-speed device */
#define OTG_FS_LSDEV (1 << 17)
/* 
This field is set by the application to indicate that this channel is communicating to a low-
speed device. */

/* Bit 16 Reserved */


/* Bit 15 - Endpoint direction */
#define OTG_FS_EPDIR (1 << 15)
/* 
Indicates whether the transaction is IN or OUT.
0: OUT
1: IN */

/* Bits [14..11] - Endpoint number */
#define OTG_FS_EPNUM ((14 - 11) << 11)
/* Indicates the endpoint number on the device serving as the data 
   source or sink. */

/* Bits [10..0] - Maximum packet size */
#define OTG_FS_MPSIZ ((10 - 0) << 0)
/* Indicates the maximum packet size of the associated endpoint. */


/* OTG_FS Host channel-x interrupt register (OTG_FS_HCINTx) 
   (x = 0..7, where x = Channel_number)
   Address offset: 0x508 + (Channel_number × 0x20) */

/* [31..11] Reserved */

