bobmittmann/thinkos/sdk/include/stm32f/stm32f-otg_fs.h
/* Bit 10 - Data toggle error */
#define OTG_FS_DTERR (1 << 10)

/* Bit 9 - Frame overrun */
#define OTG_FS_FRMOR (1 << 9)

/* Bit 8 - Babble error */
#define OTG_FS_BBERR (1 << 8)

/* Bit 7 - Transaction error */
#define OTG_FS_TXERR (1 << 7)
/* 
Indicates one of the following errors occurred on the USB.
CRC check failure
Timeout
Bit stuff error
False EOP */

/* Bit 6 Reserved */


/* Bit 5 - ACK response received/transmitted interrupt */
#define OTG_FS_ACK (1 << 5)

/* Bit 4 - NAK response received interrupt */
#define OTG_FS_NAK (1 << 4)

/* Bit 3 - STALL response received interrupt */
#define _OTG_FS_STALL (1 << 3)

/* Bit 2 Reserved */


/* Bit 1 - Channel halted */
#define OTG_FS_CHH (1 << 1)
/* 
Indicates the transfer completed abnormally either because of any USB transaction error or in
response to disable request by the application. */

/* Bit 0 - Transfer completed */
#define OTG_FS_XFRC (1 << 0)
/* 
Transfer completed normally without any errors.
OTG_FS Host channel-x interrupt mask register (OTG_FS_HCINTMSKx)
(x = 0..7, where x = Channel_number)
Address offset: 0x50C + (Channel_number × 0x20) */


/* [31..11] Reserved */


/* Bit 10 - Data toggle error mask */
#define OTG_FS_DTERRM (1 << 10)
/* 
0: Masked interrupt
1: Unmasked interrupt */

/* Bit 9 - Frame overrun mask */
#define OTG_FS_FRMORM (1 << 9)
/* 
0: Masked interrupt
1: Unmasked interrupt */

/* Bit 8 - Babble error mask */
#define OTG_FS_BBERRM (1 << 8)
/* 
0: Masked interrupt
1: Unmasked interrupt */

/* Bit 7 - Transaction error mask */
#define OTG_FS_TXERRM (1 << 7)
/* 
0: Masked interrupt
1: Unmasked interrupt */

/* Bit 6 - response received interrupt mask */
#define OTG_FS_NYET (1 << 6)
/* 
0: Masked interrupt
1: Unmasked interrupt */

/* Bit 5 - ACK response received/transmitted interrupt mask */
#define OTG_FS_ACKM (1 << 5)
/* 
0: Masked interrupt
1: Unmasked interrupt */

/* Bit 4 - NAK response received interrupt mask */
#define OTG_FS_NAKM (1 << 4)
/*
0: Masked interrupt
1: Unmasked interrupt */

/* Bit 3 - STALL response received interrupt mask */
#define OTG_FS_STALLM (1 << 3)
/* 
0: Masked interrupt
1: Unmasked interrupt */

/* Bit 2 Reserved */


/* Bit 1 - Channel halted mask */
#define OTG_FS_CHHM (1 << 1)
/* 
0: Masked interrupt
1: Unmasked interrupt */

/* Bit 0 - Transfer completed mask */
#define OTG_FS_XFRCM (1 << 0)
/* 
0: Masked interrupt
1: Unmasked interrupt
OTG_FS Host channel-x transfer size register (OTG_FS_HCTSIZx) (x = 0..7,
where x = Channel_number)
Address offset: 0x510 + (Channel_number × 0x20) */


/* Bit 31 Reserved */


/* Bits [30..29] - Data PID */
#define _OTG_FS_DPID ((30 - 29) << 29)
/* 
The application programs this field with the type of PID to use for the initial transaction. The
host maintains this field for the rest of the transfer.
00: DATA0
01: DATA2
10: DATA1
11: MDATA (non-control)/SETUP (control) */

/* Bits [28..19] - Packet count */
#define OTG_FS_PKTCNT ((28 - 19) << 19)
/* 
This field is programmed by the application with the expected number of packets to be
transmitted (OUT) or received (IN).
The host decrements this count on every successful transmission or reception of an OUT/IN
packet. Once this count reaches zero, the application is interrupted to indicate normal
completion. */

/* Bits [18..0] - Transfer size */
#define OTG_FS_XFRSIZ ((18 - 0) << 0)
/* For an OUT, this field is the number of data bytes the host sends 
   during the transfer.
   For an IN, this field is the buffer size that the application has 
   reserved for the transfer. The application is expected to program this 
   field as an integer multiple of the maximum packet size for IN 
   transactions (periodic and non-periodic). */


/* ------------------------------------------------------------------------- */
/* OTG_FS device configuration register */
#define STM32F_OTG_FS_DCFG 0x800

/* [31..13] Reserved */

/* Bits [12..11] - Periodic frame interval */
#define OTG_FS_PFIVL ((12 - 11) << 11)
#define OTG_FS_PFIVL_MSK (((1 << (12 - 11 + 1)) - 1) << 11)
#define OTG_FS_PFIVL_SET(VAL) (((VAL) << 11) & OTG_FS_PFIVL_MSK)
#define OTG_FS_PFIVL_GET(REG) (((REG) & OTG_FS_PFIVL_MSK) >> 11)
#define OTG_FS_PFIVL_80 (0 << 11)
#define OTG_FS_PFIVL_85 (1 << 11)
#define OTG_FS_PFIVL_90 (2 << 11)
#define OTG_FS_PFIVL_95 (3 << 11)
/* Indicates the time within a frame at which the application must be 
   notified using the end of periodic frame interrupt. This can be used 
   to determine if all the isochronous traffic for that frame is complete.
   00: 80% of the frame interval
   01: 85% of the frame interval
   10: 90% of the frame interval
   11: 95% of the frame interval */

/* Bits [10..4] - Device address */
#define OTG_FS_DAD ((10 - 4) << 4)
#define OTG_FS_DAD_MSK (((1 << (10 - 4 + 1)) - 1) << 4)
#define OTG_FS_DAD_SET(VAL) (((VAL) << 4) & OTG_FS_DAD_MSK)
#define OTG_FS_DAD_GET(REG) (((REG) & OTG_FS_DAD_MSK) >> 4)
/* The application must program this field after every SetAddress 
   control command. */

/* Bit 3 Reserved */

/* Bit 2 - Non-zero-length status OUT handshake */
#define OTG_FS_NZLSOHSK (1 << 2)
/* The application can use this field to select the handshake the core 
   sends on receiving a nonzero-length data packet during the OUT 
   transaction of a control transfer’s Status stage.
   1: Send a STALL handshake on a nonzero-length status OUT transaction 
   and do not send the received OUT packet to the application.
   0: Send the received OUT packet to the application (zero-length or 
   nonzero-length) and send a handshake based on the NAK and STALL bits 
   for the endpoint in the Device endpoint control register. */

/* Bits [1..0] - Device speed */
#define OTG_FS_DSPD ((1 - 0) << 0)
#define OTG_FS_DSPD_FULL (0x3 << 0)
/* Indicates the speed at which the application requires the core to 
   enumerate, or the maximum speed the application can support. However, 
   the actual bus speed is determined only after the chirp sequence is 
   completed, and is based on the speed of the USB host to which the core 
   is connected.
   00: Reserved
   01: Reserved
   10: Reserved
   11: Full speed (USB 1.1 transceiver clock is 48 MHz) */


/* ------------------------------------------------------------------------- */
/* OTG_FS device control register */
#define STM32F_OTG_FS_DCTL 0x804

/* [31..12] Reserved */

/* Bit 11 - Power-on programming done */
#define OTG_FS_POPRGDNE (1 << 11)
/* The application uses this bit to indicate that register programming is 
   completed after a wakeup from power down mode. */

/* Bit 10 - Clear global OUT NAK */
#define OTG_FS_CGONAK (1 << 10)
/* A write to this field clears the Global OUT NAK. */

/* Bit 9 - Set global OUT NAK */
#define OTG_FS_SGONAK (1 << 9)
/* A write to this field sets the Global OUT NAK.
   The application uses this bit to send a NAK handshake on all 
   OUT endpoints.
   The application must set the this bit only after making sure that 
   the Global OUT NAK effective bit in the Core interrupt register 
   (GONAKEFF bit in OTG_FS_GINTSTS) is cleared. */

/* Bit 8 - Clear global IN NAK */
#define OTG_FS_CGINAK (1 << 8)
/* A write to this field clears the Global IN NAK. */

/* Bit 7 - Set global IN NAK */
#define OTG_FS_SGINAK (1 << 7)
/* A write to this field sets the Global non-periodic IN NAK.The 
   application uses this bit to send a NAK handshake on all non-periodic 
   IN endpoints.
   The application must set this bit only after making sure that the 
   Global IN NAK effective bit in the Core interrupt register 
   (GINAKEFF bit in OTG_FS_GINTSTS) is cleared. */

/* Bits [6..4] - Test control */
#define OTG_FS_TCTL ((6 - 4) << 4)
/* 000: Test mode disabled
   001: Test_J mode
   010: Test_K mode
   011: Test_SE0_NAK mode
   100: Test_Packet mode
   101: Test_Force_Enable
   Others: Reserved */

/* Bit 3 - Global OUT NAK status */
#define OTG_FS_GONSTS (1 << 3)
/* 0: A handshake is sent based on the FIFO Status and the NAK and STALL 
   bit settings.
   1: No data is written to the RxFIFO, irrespective of space availability. 
   Sends a NAK handshake on all packets, except on SETUP transactions. 
   All isochronous OUT packets are dropped. */

