bobmittmann/thinkos/sdk/include/stm32f/stm32f-otg_fs.h
/* Bit 2 - Global IN NAK status */
#define OTG_FS_GINSTS (1 << 2)
/* 0: A handshake is sent out based on the data availability in 
   the transmit FIFO.
   1: A NAK handshake is sent out on all non-periodic IN endpoints, 
   irrespective of the data availability in the transmit FIFO. */

/* Bit 1 - Soft disconnect */
#define OTG_FS_SDIS (1 << 1)
/* The application uses this bit to signal the USB OTG core to perform a 
   soft disconnect. As long as this bit is set, the host does not see 
   that the device is connected, and the device does not receive signals 
   on the USB. The core stays in the disconnected state until the 
   application clears this bit.
   0: Normal operation. When this bit is cleared after a soft disconnect, 
   the core generates a device connect event to the USB host. When the 
   device is reconnected, the USB host restarts device enumeration.
   1: The core generates a device disconnect event to the USB host. */

/* Bit 0 - Remote wakeup signaling */
#define OTG_FS_RWUSIG (1 << 0)
/* When the application sets this bit, the core initiates remote signaling 
   to wake up the USB host. The application must set this bit to instruct 
   the core to exit the Suspend state. As specified in the USB 2.
   0 specification, the application must clear this bit 1 ms to 15 ms after 
   setting it. */


/* -------------------------------------------------------------------------
 * OTG_FS device status register */
#define STM32F_OTG_FS_DSTS 0x808

/* [31..22] Reserved */

/* Bits [21..8] - Frame number of the received SOF */
#define OTG_FS_FNSOF ((21 - 8) << 8)

/* [7..4] Reserved */

/* Bit 3 - Erratic error */
#define OTG_FS_EERR (1 << 3)
/* The core sets this bit to report any erratic errors.
   Due to erratic errors, the OTG_FS controller goes into Suspended 
   state and an interrupt is generated to the application with Early 
   suspend bit of the OTG_FS_GINTSTS register (ESUSP bit in 
   OTG_FS_GINTSTS). If the early suspend is asserted due to an erratic 
   error, the application can only perform a soft disconnect recover. */

/* Bits [2..1] - Enumerated speed */
#define OTG_FS_ENUMSPD ((2 - 1) << 1)
#define OTG_FS_ENUMSPD_MSK (((1 << (2 - 1 + 1)) - 1) << 1)
#define OTG_FS_ENUMSPD_SET(VAL) (((VAL) << 1) & OTG_FS_ENUMSPD_MSK)
#define OTG_FS_ENUMSPD_GET(REG) (((REG) & OTG_FS_ENUMSPD_MSK) >> 1)
#define OTG_FS_ENUMSPD_FULL (3 << 1)
/* Indicates the speed at which the OTG_FS controller has come up after 
   speed detection through a chirp sequence.
   01: Reserved
   10: Reserved
   11: Full speed (PHY clock is running at 48 MHz)
   Others: reserved */

/* Bit 0 - Suspend status */
#define OTG_FS_SUSPSTS (1 << 0)
/* In device mode, this bit is set as long as a Suspend condition is 
   detected on the USB. The core enters the Suspended state when there is 
   no activity on the USB data lines for a period of 3 ms. The core comes 
   out of the suspend:
   – When there is an activity on the USB data lines
   – When the application writes to the Remote wakeup signaling bit in the 
   OTG_FS_DCTL register (RWUSIG bit in OTG_FS_DCTL). */


/* -------------------------------------------------------------------------
 * OTG_FS device IN endpoint common interrupt mask register */
#define STM32F_OTG_FS_DIEPMSK 0x810

/* [31..7] Reserved */

/* Bit 6 - IN endpoint NAK effective mask */
#define OTG_FS_INEPNEM (1 << 6)
/* 0: Masked interrupt
   1: Unmasked interrupt */

/* Bit 5 - IN token received with EP mismatch mask */
#define OTG_FS_INEPNMM (1 << 5)
/* 0: Masked interrupt
   1: Unmasked interrupt */

/* Bit 4 - IN token received when TxFIFO empty mask */
#define OTG_FS_ITTXFEMSK (1 << 4)
/* 0: Masked interrupt
   1: Unmasked interrupt */

/* Bit 3 - Timeout condition mask (Non-isochronous endpoints) */
#define OTG_FS_TOM (1 << 3)
/* 0: Masked interrupt
   1: Unmasked interrupt */

/* Bit 2 Reserved */

/* Bit 1 - Endpoint disabled interrupt mask */
#define OTG_FS_EPDM (1 << 1)
/* 0: Masked interrupt
   1: Unmasked interrupt */

/* Bit 0 - Transfer completed interrupt mask */
#define OTG_FS_XFRCM (1 << 0)
/* 0: Masked interrupt
   1: Unmasked interrupt */


/* -------------------------------------------------------------------------
 * OTG_FS device OUT endpoint common interrupt mask register */
#define STM32F_OTG_FS_DOEPMSK 0x814

/* [31..5] Reserved */

/* Bit 4 - OUT token received when endpoint disabled mask */
#define OTG_FS_OTEPDM (1 << 4)
/* Applies to control OUT endpoints only.
   0: Masked interrupt
   1: Unmasked interrupt */

/* Bit 3 - SETUP phase done mask */
#define OTG_FS_STUPM (1 << 3)
/* Applies to control endpoints only.
   0: Masked interrupt
   1: Unmasked interrupt */

/* Bit 2 Reserved */

/* Bit 1 - Endpoint disabled interrupt mask */
#define OTG_FS_EPDM (1 << 1)
/* 0: Masked interrupt
   1: Unmasked interrupt */

/* Bit 0 - Transfer completed interrupt mask */
#define OTG_FS_XFRCM (1 << 0)
/* 0: Masked interrupt
   1: Unmasked interrupt */


/* -------------------------------------------------------------------------
 * OTG_FS device all endpoints interrupt register */
#define STM32F_OTG_FS_DAINT 0x818

/* Bits [31..16] - OUT endpoint interrupt bits */
#define OTG_FS_OEPINT_MSK ((31 - 16) << 16)
#define OTG_FS_OEPINT0 (1 << 16)
#define OTG_FS_OEPINT1 (1 << 17)
#define OTG_FS_OEPINT2 (1 << 18)
#define OTG_FS_OEPINT3 (1 << 19)
/* One bit per OUT endpoint:
   Bit 16 for OUT endpoint 0, bit 18 for OUT endpoint 3. */

/* Bits [15..0] - IN endpoint interrupt bits */
#define OTG_FS_IEPINT_MSK ((15 - 0) << 0)
#define OTG_FS_IEPINT0 (1 << 0)
#define OTG_FS_IEPINT1 (1 << 1)
#define OTG_FS_IEPINT2 (1 << 2)
#define OTG_FS_IEPINT3 (1 << 3)
/* One bit per IN endpoint:
   Bit 0 for IN endpoint 0, bit 3 for endpoint 3. */


/* -------------------------------------------------------------------------
 * OTG_FS all endpoints interrupt mask register */
#define STM32F_OTG_FS_DAINTMSK 0x81C
/* The OTG_FS_DAINTMSK register works with the Device endpoint 
   interrupt register to interrupt the application when an event occurs 
   on a device endpoint. However, the OTG_FS_DAINT register bit 
   corresponding to that interrupt is still set. */

/* Bits [31..16] - OUT EP interrupt mask bits */
#define OTG_FS_OEPM_MSK ((31 - 16) << 16)
#define OTG_FS_OEPM(N) (1 << (16 + (N)))
#define OTG_FS_OEPM0 (1 << 16)
#define OTG_FS_OEPM1 (1 << 17)
#define OTG_FS_OEPM2 (1 << 18)
#define OTG_FS_OEPM3 (1 << 19)
/* One per OUT endpoint:
   Bit 16 for OUT EP 0, bit 18 for OUT EP 3
   0: Masked interrupt
   1: Unmasked interrupt */

