bobmittmann/thinkos/sdk/include/stm32f/stm32f-otg_fs.h
/* Bits [15..0] - IN EP interrupt mask bits */
#define OTG_FS_IEPM_MSK ((15 - 0) << 0)
#define OTG_FS_IEPM(N) (1 << (N))
#define OTG_FS_IEPM0 (1 << 0)
#define OTG_FS_IEPM1 (1 << 1)
#define OTG_FS_IEPM2 (1 << 2)
#define OTG_FS_IEPM3 (1 << 3)
/* One bit per IN endpoint:
   Bit 0 for IN EP 0, bit 3 for IN EP 3
   0: Masked interrupt
   1: Unmasked interrupt */


/* -------------------------------------------------------------------------
 * OTG_FS device VBUS discharge time register */
#define STM32F_OTG_FS_DVBUSDIS 0x0828
/* This register specifies the VBUS discharge time after VBUS 
   pulsing during SRP. */

/* [31..16] Reserved */

/* Bits [15..0] - Device VBUS discharge time */
#define OTG_FS_VBUSDT ((15 - 0) << 0)
/* Specifies the VBUS discharge time after VBUS pulsing during SRP. This 
   value equals: VBUS discharge time in PHY clocks / 1 024
   Depending on your VBUS load, this value may need adjusting. */


/* OTG_FS device VBUS pulsing time register */
#define STM32F_OTG_FS_DVBUSPULSE 0x082C

/* This register specifies the VBUS pulsing time during SRP. */

/* [31..12] Reserved */

/* Bits [11..0] - Device VBUS pulsing time */
#define OTG_FS_DVBUSP ((11 - 0) << 0)
/* Specifies the VBUS pulsing time during SRP. This value equals: 
   VBUS pulsing time in PHY clocks / 1024 */


/* -------------------------------------------------------------------------
 * OTG_FS device IN endpoint FIFO empty interrupt mask register */
#define STM32F_OTG_FS_DIEPEMPMSK 0x834
/* This register is used to control the IN endpoint FIFO empty 
   interrupt generation (TXFE_OTG_FS_DIEPINTx). */

/* [31..16] Reserved */

/* Bits [15..0] - IN EP Tx FIFO empty interrupt mask bits */
#define OTG_FS_INEPTXFEM ((15 - 0) << 0)
/* These bits act as mask bits for OTG_FS_DIEPINTx.
   TXFE interrupt one bit per IN endpoint:
   Bit 0 for IN endpoint 0, bit 3 for IN endpoint 3
   0: Masked interrupt
   1: Unmasked interrupt */


/* -------------------------------------------------------------------------
 * OTG_FS device control IN endpoint 0 control register */
#define STM32F_OTG_FS_DIEPCTL0 0x900

/* Bit 31 - Endpoint enable */
#define OTG_FS_EPENA (1 << 31)
/* The application sets this bit to start transmitting data on the endpoint 0.
   The core clears this bit before setting any of the following interrupts 
   on this endpoint:
   – Endpoint disabled
   – Transfer completed */

/* Bit 30 - Endpoint disable */
#define OTG_FS_EPDIS (1 << 30)
/* The application sets this bit to stop transmitting data on an endpoint, 
   even before the transfer for that endpoint is complete. The application 
   must wait for the Endpoint disabled interrupt before treating the 
   endpoint as disabled. The core clears this bit before setting the 
   Endpoint disabled interrupt. The application must set this bit only if 
   Endpoint enable is already set for this endpoint. */

/* [29..28] Reserved */

/* Bit 27 - Set NAK */
#define OTG_FS_SNAK (1 << 27)
/* A write to this bit sets the NAK bit for the endpoint.
   Using this bit, the application can control the transmission of NAK 
   handshakes on an endpoint.
   The core can also set this bit for an endpoint after a SETUP packet 
   is received on that endpoint. */

/* Bit 26 - Clear NAK */
#define OTG_FS_CNAK (1 << 26)
/* A write to this bit clears the NAK bit for the endpoint. */

/* Bits [25..22] - TxFIFO number */
#define OTG_FS_TXFNUM ((25 - 22) << 22)
#define OTG_FS_TXFNUM_MSK (((1 << (25 - 22 + 1)) - 1) << 22)
#define OTG_FS_TXFNUM_SET(VAL) (((VAL) << 22) & OTG_FS_TXFNUM_MSK)
#define OTG_FS_TXFNUM_GET(REG) (((REG) & OTG_FS_TXFNUM_MSK) >> 22)
/* This value is set to the FIFO number that is assigned to IN endpoint 0. */

/* Bit 21 - STALL handshake */
#define OTG_FS_STALL (1 << 21)
/* The application can only set this bit, and the core clears it when a 
   SETUP token is received for this endpoint. If a NAK bit, a Global IN NAK 
   or Global OUT NAK is set along with this bit, the STALL 
   bit takes priority. */

/* Bit 20 Reserved */

/* Bits [19..18] - Endpoint type */
#define OTG_FS_EPTYP ((19 - 18) << 18)
/* Hardcoded to ‘00’ for control. */

/* Bit 17 - NAK status */
#define OTG_FS_NAKSTS (1 << 17)
/* Indicates the following:
   0: The core is transmitting non-NAK handshakes based on the FIFO status
   1: The core is transmitting NAK handshakes on this endpoint.
   When this bit is set, either by the application or core, the core stops 
   transmitting data, even if there are data available in the TxFIFO. 
   Irrespective of this bit’s setting, the core always responds to SETUP 
   data packets with an ACK handshake. */

/* Bit 16 Reserved */

/* Bit 15 - USB active endpoint */
#define OTG_FS_USBAEP (1 << 15)
/* This bit is always set to 1, indicating that control endpoint 0 is 
   always active in all configurations and interfaces. */

/* [14..2] Reserved */

/* Bits [1..0] - Maximum packet size */
#define OTG_FS_MPSIZ ((10 - 0) << 0)
#define OTG_FS_MPSIZ_64 (0 << 0)
#define OTG_FS_MPSIZ_32 (1 << 0)
#define OTG_FS_MPSIZ_16 (2 << 0)
#define OTG_FS_MPSIZ_8  (3 << 0)
/* The application must program this field with the maximum packet size for 
   the current logical endpoint.
   00: 64 bytes
   01: 32 bytes
   10: 16 bytes
   11: 8 bytes */


/*---------------------------------------------------------------------------
   OTG device endpoint-x control register 
   (OTG_FS_DIEPCTLx) (x = 1..3, where x = Endpoint_number)
   Address offset: 0x900 + (Endpoint_number × 0x20) */
#define OTG_FS_DIEPCTL(N) (0x900 + (N * 0x20))
#define OTG_FS_DIEPCTL1 (0x900 + (1 * 0x20))
#define OTG_FS_DIEPCTL2 (0x900 + (2 * 0x20))
#define OTG_FS_DIEPCTL3 (0x900 + (3 * 0x20))

/* Bit 31 - Endpoint enable */
#define OTG_FS_EPENA (1 << 31)
/* The application sets this bit to start transmitting data on an 
   endpoint. The core clears this bit before setting any of the 
   following interrupts on this endpoint:
   – SETUP phase done
   – Endpoint disabled
   – Transfer completed */

/* Bit 30 - Endpoint disable */
#define OTG_FS_EPDIS (1 << 30)
/* The application sets this bit to stop transmitting/receiving data on 
   an endpoint, even before the transfer for that endpoint is complete. 
   The application must wait for the Endpoint disabled interrupt before 
   treating the endpoint as disabled. The core clears this bit before 
   setting the Endpoint disabled interrupt. The application must set this 
   bit only if Endpoint enable is already set for this endpoint. */

/* Bit 29 - Set odd frame */
#define OTG_FS_SODDFRM (1 << 29)
/* Applies to isochronous IN and OUT endpoints only.
   Writing to this field sets the Even/Odd frame (EONUM) field to odd frame. */

/* Bit 28 - Set DATA0 PID */
#define OTG_FS_SD0PID (1 << 28)
/* Applies to interrupt/bulk IN endpoints only.
   Writing to this field sets the endpoint data PID (DPID) field in this 
   register to DATA0. */

/* Bit 28 - Set even frame */
#define OTG_FS_SEVNFRM (1 << 28)
/* Applies to isochronous IN endpoints only.
   Writing to this field sets the Even/Odd frame (EONUM) field to even frame. */

