bobmittmann/thinkos/sdk/include/stm32f/stm32f-otg_fs.h
/* Bit 27 - Set NAK */
#define OTG_FS_SNAK (1 << 27)
/* A write to this bit sets the NAK bit for the endpoint.
   Using this bit, the application can control the transmission of 
   NAK handshakes on an endpoint.
   The core can also set this bit for OUT endpoints on a Transfer 
   completed interrupt, or after a SETUP is received on the endpoint. */

/* Bit 26 - Clear NAK */
#define OTG_FS_CNAK (1 << 26)
/* A write to this bit clears the NAK bit for the endpoint. */

/* Bits [25..22] - TxFIFO number */
#define OTG_FS_TXFNUM ((25 - 22) << 22)
/* These bits specify the FIFO number associated with this endpoint. 
   Each active IN endpoint must be programmed to a separate FIFO number.
   This field is valid only for IN endpoints. */

/* Bit 21 - STALL handshake */
#define OTG_FS_STALL (1 << 21)
/* Applies to non-control, non-isochronous IN endpoints only (access type 
   is rw). The application sets this bit to stall all tokens from the USB 
   host to this endpoint. If a NAK bit, Global IN NAK, or Global OUT NAK 
   is set along with this bit, the STALL bit takes priority.
   Only the application can clear this bit, never the core.
   Applies to control endpoints only (access type is rs).
   The application can only set this bit, and the core clears it, when a 
   SETUP token is received for this endpoint. If a NAK bit, Global IN NAK, 
   or Global OUT NAK is set along with this bit, the STALL bit takes 
   priority. Irrespective of this bit’s setting, the core always responds to
   SETUP data packets with an ACK handshake. */

/* Bit 20 Reserved */

/* Bits [19..18] - Endpoint type */
#define OTG_FS_EPTYP ((19 - 18) << 18)
#define OTG_FS_EPTYP_MSK (((1 << (19 - 18 + 1)) - 1) << 18)
#define OTG_FS_EPTYP_SET(VAL) (((VAL) << 18) & OTG_FS_EPTYP_MSK)
#define OTG_FS_EPTYP_GET(REG) (((REG) & OTG_FS_EPTYP_MSK) >> 18)
/* This is the transfer type supported by this logical endpoint.
 * 00: Control
 * 01: Isochronous
 * 10: Bulk
 * 11: Interrupt */
#define OTG_FS_EPTYP_CTRL (0)
#define OTG_FS_EPTYP_ISOC (1)
#define OTG_FS_EPTYP_BULK (2)
#define OTG_FS_EPTYP_INT (3)

/* Bit 17 - NAK status */
#define OTG_FS_NAKSTS (1 << 17)
/* It indicates the following:
   0: The core is transmitting non-NAK handshakes based on the FIFO status.
   1: The core is transmitting NAK handshakes on this endpoint.
   When either the application or the core sets this bit:
   For non-isochronous IN endpoints: The core stops transmitting any data 
   on an IN endpoint, even if there are data available in the TxFIFO.
   For isochronous IN endpoints: The core sends out a zero-length data 
   packet, even if there are data available in the TxFIFO.
   Irrespective of this bit’s setting, the core always responds to SETUP 
   data packets with an ACK handshake. */

/* Bit 16 - Even/odd frame */
#define OTG_FS_EONUM (1 << 16)
/* Applies to isochronous IN endpoints only.
   Indicates the frame number in which the core transmits/receives 
   isochronous data for this endpoint. The application must program the 
   even/odd frame number in which it intends to transmit/receive isochronous 
   data for this endpoint using the SEVNFRM and SODDFRM fields in 
   this register.
   0: Even frame
   1: Odd frame */

/* Bit 16 - Endpoint data PID */
#define OTG_FS_DPID (1 << 16)
#define OTG_FS_DPID0 (0 << 16)
#define OTG_FS_DPID1 (1 << 16)
/* Applies to interrupt/bulk IN endpoints only.
   Contains the PID of the packet to be received or transmitted on this 
   endpoint. The application must program the PID of the first packet to 
   be received or transmitted on this endpoint, after the endpoint is 
   activated. The application uses the SD0PID register field to program 
   either DATA0 or DATA1 PID.
   0: DATA0
   1: DATA1 */

/* Bit 15 - USB active endpoint */
#define OTG_FS_USBAEP (1 << 15)
/* Indicates whether this endpoint is active in the current configuration 
   and interface. The core clears this bit for all endpoints (other than EP 
   0) after detecting a USB reset. After receiving the SetConfiguration and 
   SetInterface commands, the application must program endpoint registers 
   accordingly and set this bit. */

/* [14..11] Reserved */

/* Bits [10..0] - Maximum packet size */
#define OTG_FS_MPSIZ ((10 - 0) << 0)
#define OTG_FS_MPSIZ_MSK (((1 << (10 - 0 + 1)) - 1) << 0)
#define OTG_FS_MPSIZ_SET(VAL) (((VAL) << 0) & OTG_FS_MPSIZ_MSK)
#define OTG_FS_MPSIZ_GET(REG) (((REG) & OTG_FS_MPSIZ_MSK) >> 0)
/* The application must program this field with the maximum packet size 
   for the current logical endpoint. This value is in bytes. */


/* --------------------------------------------------------------------------
 * OTG_FS device control OUT endpoint 0 control register */
#define STM32F_OTG_FS_DOEPCTL0 0xb00 

/* Bit 31 - Endpoint enable */
#define OTG_FS_EPENA (1 << 31)
/* The application sets this bit to start transmitting data on endpoint 0.
   The core clears this bit before setting any of the following 
   interrupts on this endpoint:
   – SETUP phase done
   – Endpoint disabled
   – Transfer completed */

/* Bit 30 - Endpoint disable */
#define OTG_FS_EPDIS (1 << 30)
/* The application cannot disable control OUT endpoint 0. */

/* [29..28] Reserved */


/* Bit 27 - Set NAK */
#define OTG_FS_SNAK (1 << 27)
/* A write to this bit sets the NAK bit for the endpoint.
   Using this bit, the application can control the transmission of NAK 
   handshakes on an endpoint.
   The core can also set this bit on a Transfer completed interrupt, 
   or after a SETUP is received on the endpoint. */

/* Bit 26 - Clear NAK */
#define OTG_FS_CNAK (1 << 26)
/* A write to this bit clears the NAK bit for the endpoint. */

/* [25..22] Reserved */


/* Bit 21 - STALL handshake */
#define OTG_FS_STALL (1 << 21)
/* The application can only set this bit, and the core clears it, when 
   a SETUP token is received for this endpoint. If a NAK bit or Global 
   OUT NAK is set along with this bit, the STALL bit takes priority. 
   Irrespective of this bit’s setting, the core always responds to 
   SETUP data packets with an ACK handshake. */

/* Bit 20 - Snoop mode */
#define OTG_FS_SNPM (1 << 20)
/* This bit configures the endpoint to Snoop mode. In Snoop mode, the 
   core does not check the correctness of OUT packets before transferring 
   them to application memory. */

/* Bits [19..18] - Endpoint type */
#define OTG_FS_EPTYP ((19 - 18) << 18)
/* Hardcoded to 2’b00 for control. */

/* Bit 17 - NAK status */
#define OTG_FS_NAKSTS (1 << 17)
/* Indicates the following:
   0: The core is transmitting non-NAK handshakes based on the FIFO status.
   1: The core is transmitting NAK handshakes on this endpoint.
   When either the application or the core sets this bit, the core stops 
   receiving data, even if there is space in the RxFIFO to accommodate the 
   incoming packet. Irrespective of this bit’s setting, the core always 
   responds to SETUP data packets with an ACK handshake. */

