bobmittmann/thinkos/sdk/include/stm32f/stm32f-otg_fs.h
/* Bit 16 Reserved */


/* Bit 15 - USB active endpoint */
#define OTG_FS_USBAEP (1 << 15)
/* This bit is always set to 1, indicating that a control endpoint 0 is 
   always active in all configurations and interfaces. */

/* [14..2] Reserved */

/* Bits [1..0] - Maximum packet size */
#define OTG_FS_MPSIZ ((10 - 0) << 0)
/* The maximum packet size for control OUT endpoint 0 is the same as 
   what is programmed in control IN endpoint 0.
   00: 64 bytes
   01: 32 bytes
   10: 16 bytes
   11: 8 bytes */


/* --------------------------------------------------------------------------
 * OTG_FS device endpoint-x control register (OTG_FS_DOEPCTLx) 
 * (x = 1..3, where x = Endpoint_number)
 * Address offset for OUT endpoints: 0xB00 + (Endpoint_number × 0x20) */
#define STM32F_OTG_FS_DOEPCTL1 (0xb00 + (1 × 0x20))
#define STM32F_OTG_FS_DOEPCTL2 (0xb00 + (1 × 0x20))
#define STM32F_OTG_FS_DOEPCTL3 (0xb00 + (1 × 0x20))

/* Bit 31 - Endpoint enable */
#define OTG_FS_EPENA (1 << 31)
/* Applies to IN and OUT endpoints.
   The application sets this bit to start transmitting data on an endpoint.
   The core clears this bit before setting any of the following interrupts 
   on this endpoint:
   – SETUP phase done
   – Endpoint disabled
   – Transfer completed */

/* Bit 30 - Endpoint disable */
#define OTG_FS_EPDIS (1 << 30)
/* The application sets this bit to stop transmitting/receiving data on an 
   endpoint, even before the transfer for that endpoint is complete. The 
   application must wait for the Endpoint disabled interrupt before 
   treating the endpoint as disabled. The core clears this bit before 
   setting the Endpoint disabled interrupt. The application must set this 
   bit only if Endpoint enable is already set for this endpoint. */

/* Bit 29 - Set DATA1 PID */
#define OTG_FS_SD1PID (1 << 29)
/* Applies to interrupt/bulk IN and OUT endpoints only. Writing to this 
   field sets the endpoint data PID (DPID) field in this register to DATA1. */

/* Bit 29 - Set Set odd frame */
#define OTG_FS_SODDFRM (1 << 29)
/* Applies to isochronous IN and OUT endpoints only. Writing to this field 
   sets the Even/Odd frame (EONUM) field to odd frame. */

/* Bit 28 - Set DATA0 PID */
#define OTG_FS_SD0PID (1 << 28)
/* Applies to interrupt/bulk OUT endpoints only.
   Writing to this field sets the endpoint data PID (DPID) field in this 
   register to DATA0. */

/* Bit 28 - Set even frame */
#define OTG_FS_SEVNFRM (1 << 28)
/* Applies to isochronous OUT endpoints only. Writing to this field sets 
   the Even/Odd frame (EONUM) field to even frame. */

/* Bit 27 - Set NAK */
#define OTG_FS_SNAK (1 << 27)
/* A write to this bit sets the NAK bit for the endpoint.
   Using this bit, the application can control the transmission of NAK 
   handshakes on an endpoint. The core can also set this bit for OUT 
   endpoints on a Transfer Completed interrupt, or after a SETUP is 
   received on the endpoint. */

/* Bit 26 - Clear NAK */
#define OTG_FS_CNAK (1 << 26)
/* A write to this bit clears the NAK bit for the endpoint. */

/* [25..22] Reserved */

/* Bit 21 - STALL handshake */
#define OTG_FS_STALL (1 << 21)
/* Applies to non-control, non-isochronous OUT endpoints only (access type 
   is rw).
   The application sets this bit to stall all tokens from the USB host to 
   this endpoint. If a NAK bit, Global IN NAK, or Global OUT NAK is set 
   along with this bit, the STALL bit takes priority. Only the application 
   can clear this bit, never the core.
   Applies to control endpoints only (access type is rs).
   The application can only set this bit, and the core clears it, when a 
   SETUP token is received for this endpoint. If a NAK bit, Global IN NAK, 
   or Global OUT NAK is set along with this bit, the STALL bit takes 
   priority. Irrespective of this bit’s setting, the core always responds 
   to SETUP data packets with an ACK handshake. */

/* Bit 20 - Snoop mode */
#define OTG_FS_SNPM (1 << 20)
/* This bit configures the endpoint to Snoop mode. In Snoop mode, the core 
   does not check the correctness of OUT packets before transferring them 
   to application memory. */

/* Bits [19..18] - Endpoint type */
#define OTG_FS_EPTYP ((19 - 18) << 18)
#define OTG_FS_EPTYP_MSK (((1 << (19 - 18 + 1)) - 1) << 18)
/* This is the transfer type supported by this logical endpoint.
 * 00: Control
 * 01: Isochronous
 * 10: Bulk
 * 11: Interrupt */
#define OTG_FS_EPTYP_CTRL (0)
#define OTG_FS_EPTYP_ISOC (1)
#define OTG_FS_EPTYP_BULK (2)
#define OTG_FS_EPTYP_INT (3)

/* Bit 17 - NAK status */
#define OTG_FS_NAKSTS (1 << 17)
/* Indicates the following:
 * 0: The core is transmitting non-NAK handshakes based on the FIFO status.
 * 1: The core is transmitting NAK handshakes on this endpoint.
 * When either the application or the core sets this bit:
 * The core stops receiving any data on an OUT endpoint, even if there is 
 * space in the RxFIFO to accommodate the incoming packet.
 * Irrespective of this bit’s setting, the core always responds to SETUP 
 * data packets with an ACK handshake. */

/* Bit 16 - Even/odd frame */
#define OTG_FS_EONUM (1 << 16)
/* Applies to isochronous IN and OUT endpoints only.
   Indicates the frame number in which the core transmits/receives 
   isochronous data for this endpoint. The application must program the 
   even/odd frame number in which it intends to transmit/receive 
   isochronous data for this endpoint using the SEVNFRM and SODDFRM fields 
   in this register.
   0: Even frame
   1: Odd frame */

/* Bit 16 - Endpoint data PID */
#define OTG_FS_DPID (1 << 16)
#define OTG_FS_DPID0 (0 << 16)
#define OTG_FS_DPID1 (1 << 16)
/* Applies to interrupt/bulk OUT endpoints only.
   Contains the PID of the packet to be received or transmitted on this 
   endpoint. The application must program the PID of the first packet to 
   be received or transmitted on this endpoint, after the endpoint is 
   activated. The application uses the SD0PID register field to program 
   either DATA0 or DATA1 PID.
   0: DATA0
   1: DATA1 */

/* Bit 15 - USB active endpoint */
#define OTG_FS_USBAEP (1 << 15)
/* Indicates whether this endpoint is active in the current configuration 
   and interface. The core clears this bit for all endpoints (other than 
   EP 0) after detecting a USB reset. After receiving the SetConfiguration 
   and SetInterface commands, the application must program endpoint
   registers accordingly and set this bit. */

/* [14..11] Reserved */

/* Bits [10..0] - Maximum packet size */
#define OTG_FS_MPSIZ ((10 - 0) << 0)
/* The application must program this field with the maximum packet 
   size for the current logical endpoint. This value is in bytes. */


/* -------------------------------------------------------------------------
 * OTG_FS device endpoint-x interrupt register (OTG_FS_DIEPINTx) 
 * (x = 0..3, where x = Endpoint_number)
 * Address offset: 0x908 + (Endpoint_number × 0x20) */
#define STM32F_OTG_FS_DIEPINT0 (0x908 + (0 * 0x20))
#define STM32F_OTG_FS_DIEPINT1 (0x908 + (1 * 0x20))
#define STM32F_OTG_FS_DIEPINT2 (0x908 + (2 * 0x20))
#define STM32F_OTG_FS_DIEPINT3 (0x908 + (3 * 0x20))

/* [31..8] Reserved */

/* Bit 7 - Transmit FIFO empty */
#define OTG_FS_TXFE (1 << 7)
/* This interrupt is asserted when the TxFIFO for this endpoint is 
   either half or completely empty. The half or completely empty 
   status is determined by the TxFIFO Empty Level bit in 
   the OTG_FS_GAHBCFG register (TXFELVL bit in OTG_FS_GAHBCFG). */

/* Bit 6 - IN endpoint NAK effective */
#define OTG_FS_INEPNE (1 << 6)
/* This bit can be cleared when the application clears the IN endpoint 
   NAK by writing to the CNAK bit in OTG_FS_DIEPCTLx.
   This interrupt indicates that the core has sampled the NAK bit set 
   (either by the application or by the core). The interrupt indicates 
   that the IN endpoint NAK bit set by the application has taken effect 
   in the core.
   This interrupt does not guarantee that a NAK handshake is sent on the 
   USB. A STALL bit takes priority over a NAK bit. */

/* Bit 5 Reserved */

/* Bit 4 - IN token received when TxFIFO is empty */
#define OTG_FS_ITTXFE (1 << 4)
/* Applies to non-periodic IN endpoints only.
   Indicates that an IN token was received when the associated 
   TxFIFO (periodic/non-periodic) was empty. This interrupt is asserted 
   on the endpoint for which the IN token was received. */

/* Bit 3 - Timeout condition */
#define OTG_FS_TOC (1 << 3)
/* Applies only to Control IN endpoints.
   Indicates that the core has detected a timeout condition on 
   the USB for the last IN token on this endpoint. */

/* Bit 2 Reserved. */

/* Bit 1 - Endpoint disabled interrupt */
#define OTG_FS_EPDISD (1 << 1)
/* This bit indicates that the endpoint is disabled per the 
   application’s request. */

