bobmittmann/thinkos/sdk/include/stm32f/stm32f-otg_fs.h
/* Bit 0 - Transfer completed interrupt */
#define OTG_FS_XFRC (1 << 0)
/* This field indicates that the programmed transfer is complete on the 
   AHB as well as on the USB, for this endpoint. */


/* -------------------------------------------------------------------------
 * OTG_FS device endpoint-x interrupt register (OTG_FS_DOEPINTx) 
 * (x = 0..3, where x = Endpoint_number)
 * Address offset: 0xB08 + (Endpoint_number × 0x20) */
#define STM32F_OTG_FS_DOEPINT0 (0xb08 + (0 * 0x20))
#define STM32F_OTG_FS_DOEPINT1 (0xb08 + (1 * 0x20))
#define STM32F_OTG_FS_DOEPINT2 (0xb08 + (2 * 0x20))
#define STM32F_OTG_FS_DOEPINT3 (0xb08 + (3 * 0x20))

/* [31..7] Reserved */

/* Bit 6 - Back-to-back SETUP packets received */
#define OTG_FS_B2BSTUP (1 << 6)
/* Applies to control OUT endpoint only.
   This bit indicates that the core has received more than three 
   back-to-back SETUP packets for this particular endpoint. */

/* Bit 5 Reserved */

/* Bit 4 - OUT token received when endpoint disabled */
#define OTG_FS_OTEPDIS (1 << 4)
/* Applies only to control OUT endpoints.
   Indicates that an OUT token was received when the endpoint was not 
   yet enabled. This interrupt is asserted on the endpoint for which the 
   OUT token was received. */

/* Bit 3 - SETUP phase done */
#define OTG_FS_STUP (1 << 3)
/* Applies to control OUT endpoint only.
   Indicates that the SETUP phase for the control endpoint is complete 
   and no more back-to-back SETUP packets were received for the 
   current control transfer. On this interrupt, the application can 
   decode the received SETUP data packet. */

/* Bit 2 Reserved */

/* Bit 1 - Endpoint disabled interrupt */
#define OTG_FS_EPDISD (1 << 1)
/* This bit indicates that the endpoint is disabled per the 
   application’s request. */

/* Bit 0 - Transfer completed interrupt */
#define OTG_FS_XFRC (1 << 0)
/* This field indicates that the programmed transfer is complete on 
   the AHB as well as on the USB, for this endpoint. */


/* -------------------------------------------------------------------------
 * OTG_FS device IN endpoint 0 transfer size register */
#define STM32F_OTG_FS_DIEPTSIZ0 0x910

/* Bits [20..19] - Packet count */
#define OTG_FS_PKTCNT ((28 - 19) << 19)
#define OTG_FS_PKTCNT_MSK (((1 << (28 - 19 + 1)) - 1) << 19)
#define OTG_FS_PKTCNT_SET(VAL) (((VAL) << 19) & OTG_FS_PKTCNT_MSK)
#define OTG_FS_PKTCNT_GET(REG) (((REG) & OTG_FS_PKTCNT_MSK) >> 19)
/* Indicates the total number of USB packets that constitute the Transfer 
   Size amount of data for endpoint 0.
   This field is decremented every time a packet (maximum size or short 
   packet) is read from the TxFIFO. */

/* [18..7] Reserved */

/* Bits [6..0] - Transfer size */
#define OTG_FS_XFRSIZ ((18 - 0) << 0)
#define OTG_FS_XFRSIZ_MSK (((1 << (18 - 0 + 1)) - 1) << 0)
#define OTG_FS_XFRSIZ_SET(VAL) (((VAL) << 0) & OTG_FS_XFRSIZ_MSK)
#define OTG_FS_XFRSIZ_GET(REG) (((REG) & OTG_FS_XFRSIZ_MSK) >> 0)
/* Indicates the transfer size in bytes for endpoint 0. The core 
   interrupts the application only after it has exhausted the transfer size 
   amount of data. The transfer size can be set to the maximum packet 
   size of the endpoint, to be interrupted at the end of each packet.
   The core decrements this field every time a packet from the external 
   memory is written to the TxFIFO. */

/* -------------------------------------------------------------------------
 * OTG_FS device OUT endpoint 0 transfer size register */
#define STM32F_OTG_FS_DOEPTSIZ0 0xb10

/* Bit 31 Reserved */

/* Bits [30..29] - SETUP packet count */
#define OTG_FS_STUPCNT ((30 - 29) << 29)
#define OTG_FS_STUPCNT_1 (1 << 29)
#define OTG_FS_STUPCNT_2 (2 << 29)
#define OTG_FS_STUPCNT_3 (3 << 29)
#define OTG_FS_STUPCNT_MSK (((1 << (30 - 29 + 1)) - 1) << 29)
#define OTG_FS_STUPCNT_SET(VAL) (((VAL) << 29) & OTG_FS_STUPCNT_MSK)
#define OTG_FS_STUPCNT_GET(REG) (((REG) & OTG_FS_STUPCNT_MSK) >> 29)
/* This field specifies the number of back-to-back SETUP data packets the 
   endpoint can receive.
   01: 1 packet
   10: 2 packets
   11: 3 packets */

/* [28..20] Reserved */

/* Bit 19 - Packet count */
#define OTG_FS_PKTCNT ((28 - 19) << 19)
#define OTG_FS_PKTCNT_MSK (((1 << (28 - 19 + 1)) - 1) << 19)
#define OTG_FS_PKTCNT_SET(VAL) (((VAL) << 19) & OTG_FS_PKTCNT_MSK)
#define OTG_FS_PKTCNT_GET(REG) (((REG) & OTG_FS_PKTCNT_MSK) >> 19)
/* This field is decremented to zero after a packet is written into 
   the RxFIFO. */

/* [18..7] Reserved */

/* Bits [6..0] - Transfer size */
#define OTG_FS_XFRSIZ ((18 - 0) << 0)
#define OTG_FS_XFRSIZ_MSK (((1 << (18 - 0 + 1)) - 1) << 0)
#define OTG_FS_XFRSIZ_SET(VAL) (((VAL) << 0) & OTG_FS_XFRSIZ_MSK)
#define OTG_FS_XFRSIZ_GET(REG) (((REG) & OTG_FS_XFRSIZ_MSK) >> 0)
/* Indicates the transfer size in bytes for endpoint 0. The core 
   interrupts the application only after it has exhausted the transfer size 
   amount of data. The transfer size can be set to the maximum packet 
   size of the endpoint, to be interrupted at the end of each packet.
   The core decrements this field every time a packet is read from the 
   RxFIFO and written to the external memory. */


/* -------------------------------------------------------------------------
 * OTG_FS device endpoint-x transfer size register (OTG_FS_DIEPTSIZx)
 * (x = 1..3, where x = Endpoint_number)
 * Address offset: 0x910 + (Endpoint_number × 0x20) */
#define STM32F_OTG_FS_DIEPTSIZ1 (0x910 + (1 * 0x20))
#define STM32F_OTG_FS_DIEPTSIZ2 (0x910 + (2 * 0x20))
#define STM32F_OTG_FS_DIEPTSIZ3 (0x910 + (3 * 0x20))

/* Bit 31 Reserved */


/* Bits [30..29] - Multi count */
#define OTG_FS_MCNT ((30 - 29) << 29)
/* For periodic IN endpoints, this field indicates the number of packets 
   that must be transmitted per frame on the USB. The core uses this 
   field to calculate the data PID for isochronous IN endpoints.
   01: 1 packet
   10: 2 packets
   11: 3 packets */

/* Bits [28..19] - Packet count */
#define OTG_FS_PKTCNT ((28 - 19) << 19)
/* Indicates the total number of USB packets that constitute the Transfer 
   Size amount of data for this endpoint.
   This field is decremented every time a packet (maximum size or short 
   packet) is read from the TxFIFO. */

/* Bits [18..0] - Transfer size */
#define OTG_FS_XFRSIZ ((18 - 0) << 0)
/* This field contains the transfer size in bytes for the current 
   endpoint. The core only interrupts the application after it has 
   exhausted the transfer size amount of data. The transfer size can be
   set to the maximum packet size of the endpoint, to be interrupted at 
   the end of each packet.
   The core decrements this field every time a packet from the external 
   memory is written to the TxFIFO. */


/* -------------------------------------------------------------------------
 * OTG_FS device IN endpoint transmit FIFO status register (OTG_FS_DTXFSTSx) 
 * (x = 0..3, where x = Endpoint_number)
 * Address offset for IN endpoints: 0x918 + (Endpoint_number × 0x20) */
#define OTG_FS_DTXFSTS0 (0x918 + (0 * 0x20))
#define OTG_FS_DTXFSTS1 (0x918 + (1 * 0x20))
#define OTG_FS_DTXFSTS2 (0x918 + (2 * 0x20))
#define OTG_FS_DTXFSTS3 (0x918 + (3 * 0x20))
/* This read-only register contains the free space information for the 
   Device IN endpoint TxFIFO. */

/* 31:16 Reserved */

/* Bits [15..0] - IN endpoint TxFIFO space available */
#define OTG_FS_INEPTFSAV_MSK (((1 << (15 - 0 + 1)) - 1) << 0)
#define OTG_FS_INEPTFSAV_GET(REG) (((REG) & OTG_FS_INEPTFSAV_MSK) >> 0)
/* Indicates the amount of free space available in the Endpoint TxFIFO.
   Values are in terms of 32-bit words:
   0x0: Endpoint TxFIFO is full
   0x1: 1 word available
   0x2: 2 words available
   0xn: n words available 
   Others: Reserved */


/* -------------------------------------------------------------------------
 * OTG_FS device OUT endpoint-x transfer size register (OTG_FS_DOEPTSIZx)
 * (x = 1..3, where x = Endpoint_number)
 * Address offset: 0xB10 + (Endpoint_number × 0x20) */
#define OTG_FS_DOEPTSIZ1 (0xb10 + (1 * 0x20))
#define OTG_FS_DOEPTSIZ2 (0xb10 + (2 * 0x20))
#define OTG_FS_DOEPTSIZ3 (0xb10 + (3 * 0x20))

/* Bit 31 Reserved */

/* Bits [30..29] - Received data PID */
#define OTG_FS_RXDPID ((30 - 29) << 29)
/* Applies to isochronous OUT endpoints only.
   This is the data PID received in the last packet for this endpoint.
   00: DATA0
   01: DATA2
   10: DATA1
   11: MDATA */

