bobmittmann/thinkos/sdk/include/stm32f/stm32f-otg_fs.h
/* Bits [30..29] - SETUP packet count */
#define OTG_FS_STUPCNT ((30 - 29) << 29)
/* Applies to control OUT Endpoints only. This field specifies the number 
   of back-to-back SETUP data packets the endpoint can receive.
   01: 1 packet
   10: 2 packets
   11: 3 packets */

/* Bits [28..19] - Packet count */
#define OTG_FS_PKTCNT ((28 - 19) << 19)
/* Indicates the total number of USB packets that constitute the Transfer 
   Size amount of data for this endpoint.
   This field is decremented every time a packet (maximum size or 
   short packet) is written to the RxFIFO. */

/* Bits [18..0] - Transfer size */
#define OTG_FS_XFRSIZ ((18 - 0) << 0)
/* This field contains the transfer size in bytes for the current endpoint. 
   The core only interrupts the application after it has exhausted the 
   transfer size amount of data. The transfer size can be set to the 
   maximum packet size of the endpoint, to be interrupted at the end of 
   each packet. The core decrements this field every time a packet is 
   read from the RxFIFO and written to the external memory. */


/* -------------------------------------------------------------------------
 * OTG_FS power and clock gating control register */
#define STM32F_OTG_FS_PCGCCTL 0xe00

/* [31..5] Reserved */

/* Bit 4 - PHY Suspended */
#define OTG_FS_PHYSUSP (1 << 4)
/* Indicates that the PHY has been suspended. This bit is updated once 
   the PHY is suspended after the application has set the 
   STPPCLK bit (bit 0). */

/* [3..2] Reserved */

/* Bit 1 - Gate HCLK */
#define OTG_FS_GATEHCLK (1 << 1)
/* The application sets this bit to gate HCLK to modules other than the 
   AHB Slave and Master and wakeup logic when the USB is suspended or the 
   session is not valid. The application clears this bit when the USB is 
   resumed or a new session starts. */

/* Bit 0 - Stop PHY clock */
#define OTG_FS_STPPCLK (1 << 0)
/* The application sets this bit to stop the PHY clock when the USB is 
   suspended, the session is not valid, or the device is disconnected. 
   The application clears this bit when the USB is resumed or a new 
   session starts. */


#define OTG_FS_RAM_SIZE (1024 + 256)

#ifndef __ASSEMBLER__

#include <stdint.h>
#include <stdbool.h>

struct stm32f_otg_fs {
	/* 0x000 */
	volatile uint32_t gotgctl;
	volatile uint32_t gotgint;
	volatile uint32_t gahbcfg;
	volatile uint32_t gusbcfg;
	/* 0x010 */
	volatile uint32_t grstctl;
	volatile uint32_t gintsts;
	volatile uint32_t gintmsk;
	volatile uint32_t grxstsr;
	/* 0x020 */
	volatile uint32_t grxstsp;
	volatile uint32_t grxfsiz;
	union {
		volatile uint32_t hnptxfsiz;
		volatile uint32_t dieptxf0;
	};
	volatile uint32_t hnptxsts;
	/* 0x030 */
	uint32_t res1[2];
	volatile uint32_t gccfg;
	volatile uint32_t cid;
	/* 0x040 */
	uint32_t res2[(0x100 - 0x040) / 4];
	/* 0x100 */
	volatile uint32_t hptxfsiz;
	volatile uint32_t dieptxf1;
	volatile uint32_t dieptxf2;
	volatile uint32_t dieptxf3;
	/* 0x110 */
	uint32_t res3[(0x400 - 0x110) / 4];
	/* 0x400 */
	volatile uint32_t hcfg;
	volatile uint32_t hfir;
	volatile uint32_t hfnum;
	uint32_t res4;
	/* 0x410 */
	volatile uint32_t hptxsts;
	volatile uint32_t haint;
	volatile uint32_t haintmsk;
	/* 0x41c */
	uint32_t res5[(0x440 - 0x41c) / 4];
	/* 0x440 */
	volatile uint32_t hptr;
	/* 0x444 */
	uint32_t res6[(0x500 - 0x444) / 4];
	/* 0x500 */
	struct {
		volatile uint32_t hcchar; /* 0x500, 0x520 ... */
		uint32_t res1;    /* 0x504 */
		volatile uint32_t hcint;    /* 0x508 */
		volatile uint32_t hcintmsk; /* 0x50c */
		volatile uint32_t hctsiz;   /* 0x510 */
		uint32_t res2[3]; /* 0x514 */
	} hc[8];
	/* 0x600 */
	uint32_t res7[(0x800 - 0x600) / 4];
	/* 0x800 */
	volatile uint32_t dcfg;
	volatile uint32_t dctl;
	volatile uint32_t dsts;
	uint32_t res8;
	/* 0x810 */
	volatile uint32_t diepmsk;
	volatile uint32_t doepmsk;
	volatile uint32_t daint;
	volatile uint32_t daintmsk;
	/* 0x820 */
	uint32_t res9[2];
	/* 0x828 */
	volatile uint32_t dvbusdis;
	volatile uint32_t dvbuspulse;
	/* 0x830 */
	uint32_t res10;
	volatile uint32_t diepempmsk;
	/* 0x838 */
	uint32_t res11[(0x900 - 0x838) / 4];
	/* 0x900 */
	struct {
		volatile uint32_t diepctl; /* 0x900, 0x920, 0x940, 0x960 */
		uint32_t res1;
		volatile uint32_t diepint; /* 0x908 */
		uint32_t res2;
		volatile uint32_t dieptsiz; /* 0x910, 0x930, 0x950, 0x970*/
		uint32_t res3;
		volatile uint32_t dtxfsts; /* 0x918, 0x938, 0x958, 0x978*/
		uint32_t res4;
	} inep[4];
	/* 0x980 */
	uint32_t res12[(0xb00 - 0x980) / 4];
	struct {
		volatile uint32_t doepctl; /* 0xb00, 0xb20, 0xb40, 0xb60 */
		uint32_t res1;
		volatile uint32_t doepint; /* 0xb08, 0xb28, 0xb48, 0xb68 */
		uint32_t res2;
		volatile uint32_t doeptsiz; /* 0xb10, 0xb30, 0xb50, 0xb70*/
		uint32_t res3[3];
	} outep[4];
	/* 0xb80 */
	uint32_t res13[(0xe00 - 0xb80) / 4];
	/* 0xe00 */
	volatile uint32_t pcgcctl;
	/* 0xe04 */
	uint32_t res14[(0x1000 - 0xe04) / 4];
	/* 0x1000 */
	struct {
		union {
			volatile uint32_t pop;
			volatile uint32_t push;
		};
		uint32_t res1[(0x1000 - 4) / 4];
	} dfifo[8];
	uint32_t res15[(0x20000 - (0x1000 + (8 * 0x1000))) / 4];
	/* 0x20000 */
	uint32_t ram[32768];
};

extern const uint8_t stm32f_otg_fs_ep0_mpsiz_lut[];

#define OTGFS_EP0_MPSIZ_GET(DEPCTL) \
	stm32f_otg_fs_ep0_mpsiz_lut[OTG_FS_MPSIZ_GET(DEPCTL)]

#define OTG_FS_EP0_MPSIZ_SET(MPSIZ) ((MPSIZ == 64) ? OTG_FS_MPSIZ_64 : \
		((MPSIZ == 32) ? OTG_FS_MPSIZ_32 : \
		((MPSIZ == 16) ? OTG_FS_MPSIZ_16 : OTG_FS_MPSIZ_8)))

#ifdef __cplusplus
extern "C" {
#endif

void stm32f_otg_fs_device_init(struct stm32f_otg_fs * otg_fs);

void stm32f_otg_fs_txfifo_flush(struct stm32f_otg_fs * otg_fs,
								unsigned int num);

void stm32f_otg_fs_rxfifo_flush(struct stm32f_otg_fs * otg_fs);

void stm32f_otg_fs_addr_set(struct stm32f_otg_fs * otg_fs, unsigned int addr);

void stm32f_otg_fs_ep_disable(struct stm32f_otg_fs * otg_fs, unsigned int addr);

void stm32f_otg_fs_ep_dump(struct stm32f_otg_fs * otg_fs, unsigned int addr);

void stm32f_otg_fs_ep_enable(struct stm32f_otg_fs * otg_fs, unsigned int addr,
							 unsigned int type, unsigned int mpsiz);

/* prepare TX fifo to send */
int stm32f_otg_fs_txf_setup(struct stm32f_otg_fs * otg_fs, unsigned int ep,
							 unsigned int len);

/* push data inot TX fifo */
int stm32f_otg_fs_txf_push(struct stm32f_otg_fs * otg_fs, unsigned int ep,
						   void * buf);

void stm32f_otg_fs_enum_done(struct stm32f_otg_fs * otg_fs);

#ifdef __cplusplus
}
#endif


#endif /* __ASSEMBLER__ */

#endif /* __STM32F_OTG_FS_H__ */

